src/prelude.org
#+title: prelude

* [note]

*** (*) -- tuple-type

    - literal tuple-type -- (* <type> ...)

    - inhabit by literal tuple -- (* <data> ...)

*** (+) -- union-type

    - literal union-type -- (+ <type> ...)

    - we do not have literal union-data,
      the union-type is inhabited by [<data> : <type>] and so on

*** (data) -- named record-type

    - a type is a partly inhabited record

    - a data is a fully inhabited record

    - for example :
      (cons-t t)
      (cons-c car cdr)

    - constructor call syntax :

      - (<name>-c <data> ...) -- call-with-order

      - (<name>-c <field> = <data> ...) -- call-with-field

*** (data :> [<sub-type> ...]) -- summing sub-types

    - if declares same fields,
      and names a type-constructor for the sum-type.

    - type-constructor of each data-type
      must have the same declared fields and types

    - it can be viewed as disjoin-union,
      because data-types in the list are disjoin.

*** (data <: [<super-type> ...]) -- inheriting super-types

    - [c1 <: c2] means c1 inherit c2 's fields,
      thus c1 is more special then c2,
      because c1 has more interface functions than c2.

    - whatever data inhabits c1 also inhabits c2.

*** (::) -- implicit arguments

    - in arguments :

      - the value of the argument will be inferred.
        use call-with-field syntax to give explicit value.

    - in return values :

      - the value must be constructed by the function.
        but normal function call syntax will not return the value.
        use explicit (with-details (<name> ...) ...) to get all details.

*** level of universe

***** accumulative or not ?

      - I choose to be non-accumulative for now.

      - It means (:) is not transitive.

