prelude.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-20 Fri 03:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>prelude</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">prelude</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b7a1a9"><span class="todo _note_">[note]</span> </a>
<ul>
<li><a href="#org373a587">(*) &#x2013; tuple-type</a></li>
<li><a href="#orgd6df84c">(+) &#x2013; union-type</a></li>
<li><a href="#org76c5a35">(data) &#x2013; named record-type</a></li>
<li><a href="#orgd10d9fb">(data :&gt; [&lt;sub-type&gt; &#x2026;]) &#x2013; summing sub-types</a></li>
<li><a href="#orga19847f">(data &lt;: [&lt;super-type&gt; &#x2026;]) &#x2013; inheriting super-types</a></li>
<li><a href="#org81e5deb">(::) &#x2013; implicit arguments</a></li>
<li><a href="#orgb73577b">level of universe</a>
<ul>
<li><a href="#org1439b10">accumulative or not ?</a></li>
<li><a href="#org4f3a707">level rule</a></li>
<li><a href="#org35b7dde">level examples</a></li>
<li><a href="#orgeee71de">level table</a></li>
<li><a href="#orgeeb16b5">builtin level polymorphism</a></li>
<li><a href="#orgeb5fb71"><span class="done _todo_">[todo]</span> searchable-type vs non-searchable-type</a></li>
<li><a href="#orga02d752"><span class="done _todo_">[todo]</span> implicit generic-ness of haskell type-class</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2f70850">void</a>
<ul>
<li><a href="#org89a9d0c">void-t</a></li>
<li><a href="#org55dede1">absurd</a></li>
</ul>
</li>
<li><a href="#org434ac24">unit</a>
<ul>
<li><a href="#org9f636a0">unit-t</a></li>
<li><a href="#org33d9efb">unit</a></li>
</ul>
</li>
<li><a href="#orgbc0ff02">bool</a>
<ul>
<li><a href="#orga6f24f7">bool-t</a></li>
</ul>
</li>
<li><a href="#org19aaf2b">eqv</a>
<ul>
<li><a href="#orga144f31">eqv-t</a></li>
<li><a href="#org7ef6193">eqv-apply</a></li>
<li><a href="#orgcf1ff71">eqv-swap</a></li>
<li><a href="#orgedd8f57">eqv-compose</a></li>
</ul>
</li>
<li><a href="#org14d0a2d">nat</a>
<ul>
<li><a href="#orgb81144c">nat-t</a></li>
<li><a href="#org895edbc">nat-add</a></li>
<li><a href="#org4879cd">nat-mul</a></li>
<li><a href="#orgdf1260c">nat-factorial</a></li>
<li><a href="#org20ed3e3">nat-even-p</a></li>
<li><a href="#org6e9bc56">nat-even-t</a></li>
<li><a href="#org5685f60">two-even</a></li>
<li><a href="#org6473adb">nat-add-associative</a></li>
<li><a href="#org509db75">nat-add-commutative</a></li>
<li><a href="#org64350d9">nat-add-zero-commutative</a></li>
<li><a href="#org7d3a1dc">nat-add-succ-commutative-1</a></li>
<li><a href="#org8cc5c69">nat-add-succ-commutative-2</a></li>
</ul>
</li>
<li><a href="#org49b4ba3">list</a>
<ul>
<li><a href="#org6b01f7d">list-t</a></li>
<li><a href="#org3999cfb">list-length</a></li>
<li><a href="#org60c320">list-append</a></li>
<li><a href="#orgff6165e">list-map</a></li>
<li><a href="#org15ae56e">list-remove-first</a></li>
<li><a href="#orgaa58d0f">list-length-t</a></li>
<li><a href="#orgec0fa63"><span class="todo _note_">[note]</span> `append` in prolog</a></li>
<li><a href="#org87979b1">list-append-t</a></li>
</ul>
</li>
<li><a href="#orgd23e4f3">vect</a>
<ul>
<li><a href="#org756209a">vect-t</a></li>
<li><a href="#orge5d6e56">vect-append</a></li>
<li><a href="#org6101ae0">vect-map</a></li>
</ul>
</li>
<li><a href="#org238fe16">order</a>
<ul>
<li><a href="#orgd747a9">preorder-tt</a></li>
<li><a href="#orgd326f36">partial-order-tt</a></li>
<li><a href="#org3795291">eqv-relation-tt</a></li>
<li><a href="#orgd15b0a1">total-order-tt</a></li>
</ul>
</li>
<li><a href="#orgb5caacc">unique</a>
<ul>
<li><a href="#orge9b7f21">unique-tt</a></li>
<li><a href="#org6c19adf">(unique)</a></li>
</ul>
</li>
<li><a href="#orgea5e7fd">category</a>
<ul>
<li><a href="#org18a60c7">category-ttt</a></li>
<li><a href="#orgd2e6230">basic relation</a>
<ul>
<li><a href="#org1113572">category.isomorphic-tt</a></li>
</ul>
</li>
<li><a href="#orgb8ec921">universal construction</a>
<ul>
<li><a href="#orge40e4c4">category.initial-tt</a></li>
<li><a href="#orge7fdd97">category.terminal-tt</a></li>
<li><a href="#orge4a48fa">category.product-tt</a></li>
<li><a href="#org118a8a8">category.sum-tt</a></li>
</ul>
</li>
<li><a href="#org53d3082">other structure as category</a>
<ul>
<li><a href="#org4dfc440">preorder.as-category</a></li>
</ul>
</li>
<li><a href="#orgf5b7620">build new category from old category</a>
<ul>
<li><a href="#org1d9f42d">category.opposite</a></li>
<li><a href="#org2485dba">category-product</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3480eee">product-closed-category</a>
<ul>
<li><a href="#org415737a">product-closed-category-ttt</a></li>
<li><a href="#org6d5cc8c">product-closed-category.product-arrow</a></li>
<li><a href="#org6dc5bb2">product-closed-category.exponential-tt</a></li>
</ul>
</li>
<li><a href="#org514ee00"><span class="done _todo_">[todo]</span> cartesian-closed-category</a></li>
<li><a href="#org322256d">void-category</a>
<ul>
<li><a href="#orgbd7d748">void-arrow-t</a></li>
<li><a href="#orgfbf8d79">void-arrow-eqv-t</a></li>
<li><a href="#org9d010da">void-category</a></li>
</ul>
</li>
<li><a href="#org6185284">graph-tt</a>
<ul>
<li><a href="#org41c24d2">graph-tt</a></li>
<li><a href="#org93494f">graph.path-t</a></li>
<li><a href="#orgcdc5bc6">graph.path-eqv-t</a></li>
<li><a href="#org9717f11">graph.as-free-category</a></li>
</ul>
</li>
<li><a href="#orgf3ef4b3">nat-order-category</a>
<ul>
<li><a href="#org6d29813">nat-lteq-t</a></li>
<li><a href="#org1a6a80b">nat-non-negative</a></li>
<li><a href="#orgeb4970c">nat-lteq-reflexive</a></li>
<li><a href="#orgb4b2bee">nat-lteq-transitive</a></li>
<li><a href="#org5132c04">nat-lt-t</a></li>
<li><a href="#orge370217">nat-archimedean-property</a></li>
<li><a href="#org50db30f">nat-order-category</a></li>
</ul>
</li>
<li><a href="#org3f4375f">groupoid</a>
<ul>
<li><a href="#org782e9f8">groupoid-tt</a></li>
</ul>
</li>
<li><a href="#org4d01c26"><span class="done _todo_">[todo]</span> nat-total-order</a></li>
<li><a href="#org4bcf2b1">monoid</a>
<ul>
<li><a href="#org316bd81">monoid-tt</a></li>
<li><a href="#org463b37c">monoid.as-category</a></li>
</ul>
</li>
<li><a href="#org82394af"><span class="done _todo_">[todo]</span> group</a></li>
<li><a href="#org8354133"><span class="done _todo_">[todo]</span> abelian-group</a></li>
<li><a href="#orgd2b30fe"><span class="done _todo_">[todo]</span> ring</a></li>
<li><a href="#org193b4f2"><span class="done _todo_">[todo]</span> field</a></li>
<li><a href="#org90c45a1"><span class="done _todo_">[todo]</span> vector-space</a></li>
<li><a href="#org3de5158"><span class="done _todo_">[todo]</span> limit</a></li>
<li><a href="#org27684e5">container</a>
<ul>
<li><a href="#org551dd88">container-tt</a></li>
<li><a href="#org472f598">list-container</a></li>
</ul>
</li>
<li><a href="#org8301a7f">const</a>
<ul>
<li><a href="#orgf6cad3">const-t</a></li>
<li><a href="#orgbacc45">const-container</a></li>
</ul>
</li>
<li><a href="#org3b529e2">monad</a>
<ul>
<li><a href="#org62f6d1a">monad-tt</a></li>
<li><a href="#org8acb74a">monad.compose</a></li>
<li><a href="#orgb1b3b32">monad.flatten</a></li>
<li><a href="#org38da380">list-monad</a></li>
</ul>
</li>
<li><a href="#orgf4cb38e">maybe</a>
<ul>
<li><a href="#org725ca07">maybe-t</a></li>
<li><a href="#orgfde8567">maybe-container</a></li>
<li><a href="#org5d7b3c6">maybe-monad</a></li>
</ul>
</li>
<li><a href="#orge8bbaa">state</a>
<ul>
<li><a href="#org2301221">state-t</a></li>
<li><a href="#org20ecec9">state-monad</a></li>
</ul>
</li>
<li><a href="#org1747e97">tree</a>
<ul>
<li><a href="#org1562580">tree-t</a></li>
<li><a href="#org2bff4e5">tree-container</a></li>
<li><a href="#org708df32">tree-zip</a></li>
<li><a href="#org3ae9375">tree-numbering</a></li>
</ul>
</li>
<li><a href="#orgc27af9a">int</a>
<ul>
<li><a href="#org90731ff"><span class="done _todo_">[todo]</span> int-t</a></li>
<li><a href="#org6ebf319"><span class="done _todo_">[todo]</span> mod-t</a></li>
<li><a href="#org7619f50">gcd-t</a></li>
</ul>
</li>
<li><a href="#org20e4379">set-category</a>
<ul>
<li><a href="#orgc55ed1c"><span class="done _todo_">[todo]</span> set-tt</a></li>
<li><a href="#org2bdf96b">set-morphism-tt</a></li>
<li><a href="#org2b8fca1">set-morphism-eqv-tt</a></li>
<li><a href="#orgeb60068">set-category</a></li>
<li><a href="#org6fdb6fe">set-category &#x2013; without type</a></li>
</ul>
</li>
<li><a href="#org42333bb">preorder-category</a>
<ul>
<li><a href="#orgaa3178">preorder-morphism-tt</a></li>
<li><a href="#org3da2328">preorder-morphism-eqv-tt</a></li>
<li><a href="#org7c5d8a">preorder-category</a></li>
</ul>
</li>
<li><a href="#org813bf12">category-category</a>
<ul>
<li><a href="#orge636eca">functor-ttt</a></li>
<li><a href="#orgfb4d22a">natural-transformation-ttt</a></li>
<li><a href="#org102699d">natural-isomorphism-ttt</a></li>
<li><a href="#org31c5eb8"><span class="done _todo_">[todo]</span> category-category</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4b7a1a9" class="outline-2">
<h2 id="org4b7a1a9"><span class="todo _note_">[note]</span> </h2>
<div class="outline-text-2" id="text-org4b7a1a9">
</div><div id="outline-container-org373a587" class="outline-3">
<h3 id="org373a587">(*) &#x2013; tuple-type</h3>
<div class="outline-text-3" id="text-org373a587">
<ul class="org-ul">
<li><p>literal tuple-type &#x2013; (* &lt;type&gt; &#x2026;)</p></li>

<li><p>inhabit by literal tuple &#x2013; (* &lt;data&gt; &#x2026;)</p></li></ul>
</div>
</div>

<div id="outline-container-orgd6df84c" class="outline-3">
<h3 id="orgd6df84c">(+) &#x2013; union-type</h3>
<div class="outline-text-3" id="text-orgd6df84c">
<ul class="org-ul">
<li><p>literal union-type &#x2013; (+ &lt;type&gt; &#x2026;)</p></li>

<li><p>we do not have literal union-data,</p><p>the union-type is inhabited by [&lt;data&gt; : &lt;type&gt;] and so on</p></li></ul>
</div>
</div>

<div id="outline-container-org76c5a35" class="outline-3">
<h3 id="org76c5a35">(data) &#x2013; named record-type</h3>
<div class="outline-text-3" id="text-org76c5a35">
<ul class="org-ul">
<li><p>a type is a partly inhabited record</p></li>

<li><p>a data is a fully inhabited record</p></li>

<li><p>for example :</p><p>(cons-t t)</p><p>(cons-c car cdr)</p></li>

<li><p>constructor call syntax :</p><p></p><p><ul class="org-ul"></p><p><li><p>(&lt;name&gt;-c &lt;data&gt; &#x2026;) &#x2013; call-with-order</p></li></p><p></p><p><li><p>(&lt;name&gt;-c &lt;field&gt; = &lt;data&gt; &#x2026;) &#x2013; call-with-field</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgd10d9fb" class="outline-3">
<h3 id="orgd10d9fb">(data :&gt; [&lt;sub-type&gt; &#x2026;]) &#x2013; summing sub-types</h3>
<div class="outline-text-3" id="text-orgd10d9fb">
<ul class="org-ul">
<li><p>if declares same fields,</p><p>and names a type-constructor for the sum-type.</p></li>

<li><p>type-constructor of each data-type</p><p>must have the same declared fields and types</p></li>

<li><p>it can be viewed as disjoin-union,</p><p>because data-types in the list are disjoin.</p></li></ul>
</div>
</div>

<div id="outline-container-orga19847f" class="outline-3">
<h3 id="orga19847f">(data &lt;: [&lt;super-type&gt; &#x2026;]) &#x2013; inheriting super-types</h3>
<div class="outline-text-3" id="text-orga19847f">
<ul class="org-ul">
<li><p>[c1 &lt;: c2] means c1 inherit c2 's fields,</p><p>thus c1 is more special then c2,</p><p>because c1 has more interface functions than c2.</p></li>

<li><p>whatever data inhabits c1 also inhabits c2.</p></li></ul>
</div>
</div>

<div id="outline-container-org81e5deb" class="outline-3">
<h3 id="org81e5deb">(::) &#x2013; implicit arguments</h3>
<div class="outline-text-3" id="text-org81e5deb">
<ul class="org-ul">
<li><p>in arguments :</p><p></p><p><ul class="org-ul"></p><p><li><p>the value of the argument will be inferred.</p><p>use call-with-field syntax to give explicit value.</p></li></ul></p></li>

<li><p>in return values :</p><p></p><p><ul class="org-ul"></p><p><li><p>the value must be constructed by the function.</p><p>but normal function call syntax will not return the value.</p><p>use explicit (with-details (&lt;name&gt; &#x2026;) &#x2026;) to get all details.</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgb73577b" class="outline-3">
<h3 id="orgb73577b">level of universe</h3>
<div class="outline-text-3" id="text-orgb73577b">
</div><div id="outline-container-org1439b10" class="outline-4">
<h4 id="org1439b10">accumulative or not ?</h4>
<div class="outline-text-4" id="text-org1439b10">
<ul class="org-ul">
<li><p>I choose to be non-accumulative for now.</p></li>

<li><p>It means (:) is not transitive.</p></li></ul>
</div>
</div>
