src/prelude.org
***** level rule

      #+begin_src cicada
      (level (* <type> ...)) = (max (level <type>) ...)

      (level (+ <type> ...)) = (max (level <type>) ...)

      (level (-- <type> ... -> <result-type>)) =
      (max (level <type>) ... (level <result-type>))
      #+end_src

***** level examples

      | 0                   | 1       | 2        |
      |---------------------+---------+----------|
      | nat-t               | type-tt | type-ttt |
      | (* nat-t nat-t)     | type-tt | type-ttt |
      | (+ bool-t nat-t)    | type-tt | type-ttt |
      | (-- nat-t -> nat-t) | type-tt | type-ttt |
      | list-t              | type-tt | type-ttt |

***** level table

      | 0 | data, object           |
      |---+------------------------|
      | 1 | <name>-t, data-type    |
      |   | union-type, tuple-type |
      |---+------------------------|
      | 2 | type-tt, category-tt   |
      |---+------------------------|
      | 3 | type-ttt, category-ttt |

***** builtin level polymorphism

      - we can not really afford to
        split category-t* to category-t and category-tt,
        because we have to redefined so many types along category-t.

      - instead we assume that when a type is define in one level,
        it is defined for all levels.

        and all the postfix changes
        are handled by the language implicitly.

        - for example, when
          [category-tt : type-ttt] is defined,
          [category-ttt : type-tttt] is also defined.

      - a convention is that
        we only write down the level or levels
        in which the type is most used.

        - for example :
          [category-morphism-ttt : type-tttt]
          [category-category : category-tttt]

***** [todo] searchable-type vs non-searchable-type

      - (-- <type> ... -> <result-type>)
        is the most important example of searchable-type.

***** [todo] implicit generic-ness of haskell type-class

      - by maintain a map from type-constructor to class-like types.

      - something like the template of c++.

* void

*** void-t

    #+begin_src cicada
    void-t : type-tt
    void-t = data :> []
    #+end_src

*** absurd

    #+begin_src cicada
    absurd : -- void-t -> t
    #+end_src

* unit

*** unit-t

    #+begin_src cicada
    unit-t : type-tt
    unit-t = data
    #+end_src

*** unit

    #+begin_src cicada
    unit : -- a -> unit-t
    unit a = unit-c
    #+end_src

* bool

*** bool-t

    #+begin_src cicada
    bool-t : type-tt
    bool-t = data :> [true-t false-t]

    true-t : type-tt
    true-t = data

    false-t : type-tt
    false-t = data
    #+end_src

* eqv

*** eqv-t

    #+begin_src cicada
    eqv-t : type-tt
    eqv-t = data
      [lhs rhs] : t
      lhs = rhs
    #+end_src

*** eqv-apply

    #+begin_src cicada
    eqv-apply :
      -- fun : (-- a -> b)
         (eqv-t x y)
      -> (eqv-t (fun x) (fun y))
    eqv-apply _ _ = eqv-c
    #+end_src

*** eqv-swap

    #+begin_src cicada
    eqv-swap : -- (eqv-t x y) -> (eqv-t y x)
    eqv-swap _ = eqv-c
    #+end_src

*** eqv-compose

    #+begin_src cicada
    eqv-compose : -- (eqv-t x y) (eqv-t y z) -> (eqv-t x z)
    eqv-compose _ _ = eqv-c
    #+end_src

* nat

*** nat-t

    #+begin_src cicada
    nat-t : type-tt
    nat-t = data :> [zero-t succ-t]

    zero-t : type-tt
    zero-t = data

    succ-t : type-tt
    succ-t = data
      prev : nat-t
    #+end_src

