prelude.html

<div id="outline-container-org4f3a707" class="outline-4">
<h4 id="org4f3a707">level rule</h4>
<div class="outline-text-4" id="text-org4f3a707">
<div class="org-src-container">

<pre class="src src-cicada">(level (<span style="color: #7CB8BB;">*</span> <span style="color: #7CB8BB;">&lt;type&gt;</span> ...)) <span style="color: #DFAF8F;">=</span> (max (level <span style="color: #7CB8BB;">&lt;type&gt;</span>) ...)

(level (<span style="color: #7CB8BB;">+</span> <span style="color: #7CB8BB;">&lt;type&gt;</span> ...)) <span style="color: #DFAF8F;">=</span> (max (level <span style="color: #7CB8BB;">&lt;type&gt;</span>) ...)

(level (<span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">&lt;type&gt;</span> ... <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">&lt;result-type&gt;</span>)) <span style="color: #DFAF8F;">=</span>
(max (level <span style="color: #7CB8BB;">&lt;type&gt;</span>) ... (level <span style="color: #7CB8BB;">&lt;result-type&gt;</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org35b7dde" class="outline-4">
<h4 id="org35b7dde">level examples</h4>
<div class="outline-text-4" id="text-org35b7dde">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">0</th>
<th scope="col" class="org-left">1</th>
<th scope="col" class="org-left">2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nat-t</td>
<td class="org-left">type-tt</td>
<td class="org-left">type-ttt</td>
</tr>

<tr>
<td class="org-left">(* nat-t nat-t)</td>
<td class="org-left">type-tt</td>
<td class="org-left">type-ttt</td>
</tr>

<tr>
<td class="org-left">(+ bool-t nat-t)</td>
<td class="org-left">type-tt</td>
<td class="org-left">type-ttt</td>
</tr>

<tr>
<td class="org-left">(&#x2013; nat-t -&gt; nat-t)</td>
<td class="org-left">type-tt</td>
<td class="org-left">type-ttt</td>
</tr>

<tr>
<td class="org-left">list-t</td>
<td class="org-left">type-tt</td>
<td class="org-left">type-ttt</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgeee71de" class="outline-4">
<h4 id="orgeee71de">level table</h4>
<div class="outline-text-4" id="text-orgeee71de">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">0</th>
<th scope="col" class="org-left">data, object</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">&lt;name&gt;-t, data-type</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">union-type, tuple-type</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">type-tt, category-tt</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-left">type-ttt, category-ttt</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgeeb16b5" class="outline-4">
<h4 id="orgeeb16b5">builtin level polymorphism</h4>
<div class="outline-text-4" id="text-orgeeb16b5">
<ul class="org-ul">
<li><p>we can not really afford to</p><p>split category-t* to category-t and category-tt,</p><p>because we have to redefined so many types along category-t.</p></li>

<li><p><p></p><p>instead we assume that when a type is define in one level,</p><p>it is defined for all levels.</p><p></p></p><p></p><p><p></p><p>and all the postfix changes</p><p>are handled by the language implicitly.</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>for example, when</p><p>[category-tt : type-ttt] is defined,</p><p>[category-ttt : type-tttt] is also defined.</p></li></ul></p></li>

<li><p>a convention is that</p><p>we only write down the level or levels</p><p>in which the type is most used.</p><p></p><p><ul class="org-ul"></p><p><li><p>for example :</p><p>[category-morphism-ttt : type-tttt]</p><p>[category-category : category-tttt]</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgeb5fb71" class="outline-4">
<h4 id="orgeb5fb71"><span class="done _todo_">[todo]</span> searchable-type vs non-searchable-type</h4>
<div class="outline-text-4" id="text-orgeb5fb71">
<ul class="org-ul">
<li><p>(&#x2013; &lt;type&gt; &#x2026; -&gt; &lt;result-type&gt;)</p><p>is the most important example of searchable-type.</p></li></ul>
</div>
</div>

<div id="outline-container-orga02d752" class="outline-4">
<h4 id="orga02d752"><span class="done _todo_">[todo]</span> implicit generic-ness of haskell type-class</h4>
<div class="outline-text-4" id="text-orga02d752">
<ul class="org-ul">
<li><p>by maintain a map from type-constructor to class-like types.</p></li>

<li><p>something like the template of c++.</p></li></ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f70850" class="outline-2">
<h2 id="org2f70850">void</h2>
<div class="outline-text-2" id="text-org2f70850">
</div><div id="outline-container-org89a9d0c" class="outline-3">
<h3 id="org89a9d0c">void-t</h3>
<div class="outline-text-3" id="text-org89a9d0c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">void-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">void-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> []
</pre>
</div>
</div>
</div>

<div id="outline-container-org55dede1" class="outline-3">
<h3 id="org55dede1">absurd</h3>
<div class="outline-text-3" id="text-org55dede1">
<div class="org-src-container">

<pre class="src src-cicada">absurd <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">void-t</span> <span style="color: #7CB8BB;">-&gt;</span> t
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org434ac24" class="outline-2">
<h2 id="org434ac24">unit</h2>
<div class="outline-text-2" id="text-org434ac24">
</div><div id="outline-container-org9f636a0" class="outline-3">
<h3 id="org9f636a0">unit-t</h3>
<div class="outline-text-3" id="text-org9f636a0">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">unit-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">unit-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org33d9efb" class="outline-3">
<h3 id="org33d9efb">unit</h3>
<div class="outline-text-3" id="text-org33d9efb">
<div class="org-src-container">

<pre class="src src-cicada">unit <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">unit-t</span>
unit a <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">unit-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc0ff02" class="outline-2">
<h2 id="orgbc0ff02">bool</h2>
<div class="outline-text-2" id="text-orgbc0ff02">
</div><div id="outline-container-orga6f24f7" class="outline-3">
<h3 id="orga6f24f7">bool-t</h3>
<div class="outline-text-3" id="text-orga6f24f7">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">bool-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">bool-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">true-t</span> <span style="color: #7CB8BB;">false-t]</span>

<span style="color: #7CB8BB;">true-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">true-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">data</span>

<span style="color: #7CB8BB;">false-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">false-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org19aaf2b" class="outline-2">
<h2 id="org19aaf2b">eqv</h2>
<div class="outline-text-2" id="text-org19aaf2b">
</div><div id="outline-container-orga144f31" class="outline-3">
<h3 id="orga144f31">eqv-t</h3>
<div class="outline-text-3" id="text-orga144f31">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> t
  lhs <span style="color: #DFAF8F;">=</span> rhs
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ef6193" class="outline-3">
<h3 id="org7ef6193">eqv-apply</h3>
<div class="outline-text-3" id="text-org7ef6193">
<div class="org-src-container">

<pre class="src src-cicada">eqv-apply <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> fun <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b)
     (<span style="color: #7CB8BB;">eqv-t</span> x y)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> (fun x) (fun y))
eqv-apply _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf1ff71" class="outline-3">
<h3 id="orgcf1ff71">eqv-swap</h3>
<div class="outline-text-3" id="text-orgcf1ff71">
<div class="org-src-container">

<pre class="src src-cicada">eqv-swap <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">eqv-t</span> x y) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> y x)
eqv-swap _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgedd8f57" class="outline-3">
<h3 id="orgedd8f57">eqv-compose</h3>
<div class="outline-text-3" id="text-orgedd8f57">
<div class="org-src-container">

<pre class="src src-cicada">eqv-compose <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">eqv-t</span> x y) (<span style="color: #7CB8BB;">eqv-t</span> y z) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> x z)
eqv-compose _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org14d0a2d" class="outline-2">
<h2 id="org14d0a2d">nat</h2>
<div class="outline-text-2" id="text-org14d0a2d">
</div><div id="outline-container-orgb81144c" class="outline-3">
<h3 id="orgb81144c">nat-t</h3>
<div class="outline-text-3" id="text-orgb81144c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">nat-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">nat-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-t</span> <span style="color: #7CB8BB;">succ-t]</span>

<span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">data</span>

<span style="color: #7CB8BB;">succ-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">succ-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  prev <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
</pre>
</div>
</div>
</div>
