src/prelude.org
*** nat-add

    #+begin_src cicada
    nat-add : -- nat-t nat-t -> nat-t
    nat-add x y =
      case x
        zero-t y
        succ-t (succ-c (recur x.prev y))
    #+end_src

*** nat-mul

    #+begin_src cicada
    nat-mul : -- nat-t nat-t -> nat-t
    nat-mul x y =
      case x
        zero-t zero-c
        succ-t (nat-add y (recur x.prev y))
    #+end_src

*** nat-factorial

    #+begin_src cicada
    nat-factorial : -- nat-t -> nat-t
    nat-factorial x =
      case x
        zero-t (succ-c zero-c)
        succ-t (nat-mul x (recur x.prev))
    #+end_src

*** nat-even-p

    #+begin_src cicada
    nat-even-p : -- nat-t -> bool-t
    nat-even-p x =
      case x
        zero-t true-c
        succ-t case x.prev
          zero-t false-c
          succ-t (recur x.prev.prev)
    #+end_src

*** nat-even-t

    #+begin_src cicada
    nat-even-t : type-tt
    nat-even-t = data :> [zero-even-t even-plus-two-even-t]
      nat : nat-t

    zero-even-t : type-tt
    zero-even-t = data
      nat : nat-t
      nat = zero-c

    even-plus-two-even-t : type-tt
    even-plus-two-even-t = data
      nat : nat-t
      prev : (nat-even-t m)
      nat = (succ-c (succ-c m))
    #+end_src

*** two-even

    #+begin_src cicada
    two-even : (nat-even-t (succ-c (succ-c zero-c)))
    two-even = (even-plus-two-even-c zero-even-c)
    #+end_src

*** nat-add-associative

    #+begin_src cicada
    nat-add-associative :
      -- [x y z] : nat-t
      -> (eqv-t
           (nat-add (nat-add x y) z)
           (nat-add x (nat-add y z)))
    nat-add-associative x y z =
      case x
        zero-t eqv-c
        succ-t (eqv-apply succ-c (recur x.prev y z))
    #+end_src

*** nat-add-commutative

    #+begin_src cicada
    nat-add-commutative :
      -- [x y] : nat-t
      -> (eqv-t
           (nat-add x y)
           (nat-add y x))
    nat-add-commutative x y =
      case x
        zero-t (nat-add-zero-commutative y)
        succ-t
          (eqv-compose
            (eqv-apply succ-c (recur x.prev y))
            (nat-add-succ-commutative y x.prev))
    #+end_src

*** nat-add-zero-commutative

    #+begin_src cicada
    nat-add-zero-commutative :
      -- x : nat-t
      -> (eqv-t
           (nat-add zero-c x)
           (nat-add x zero-c))
    nat-add-zero-commutative x =
      case x
        zero-t eqv-c
        succ-t (eqv-apply succ-c (recur x.prev))
    #+end_src

*** nat-add-succ-commutative-1

    #+begin_src cicada
    nat-add-succ-commutative-1 :
      -- [x y] : nat-t
      -> (eqv-t
           (nat-add (succ-c x) y)
           (succ-c (nat-add x y)))
    nat-add-succ-commutative-1 x y =
      case x
        zero-t eqv-c
        succ-t (eqv-apply succ-c (recur x.prev y))
    #+end_src

*** nat-add-succ-commutative-2

    #+begin_src cicada
    nat-add-succ-commutative-2 :
      -- [x y] : nat-t
      -> (eqv-t
           (nat-add y (succ-c x))
           (succ-c (nat-add x y)))
    nat-add-succ-commutative-2 x y =
      case x
        zero-t eqv-c
        succ-t (eqv-apply succ-c (recur x.prev y))
    #+end_src

* list

