prelude.html

<div id="outline-container-org895edbc" class="outline-3">
<h3 id="org895edbc">nat-add</h3>
<div class="outline-text-3" id="text-org895edbc">
<div class="org-src-container">

<pre class="src src-cicada">nat-add <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">nat-t</span>
nat-add x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> y
    <span style="color: #7CB8BB;">succ-t</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4879cd" class="outline-3">
<h3 id="org4879cd">nat-mul</h3>
<div class="outline-text-3" id="text-org4879cd">
<div class="org-src-container">

<pre class="src src-cicada">nat-mul <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">nat-t</span>
nat-mul x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">zero-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (nat-add y (<span style="color: #7CB8BB;">recur</span> x.prev y))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf1260c" class="outline-3">
<h3 id="orgdf1260c">nat-factorial</h3>
<div class="outline-text-3" id="text-orgdf1260c">
<div class="org-src-container">

<pre class="src src-cicada">nat-factorial <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">nat-t</span>
nat-factorial n <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> n
    <span style="color: #7CB8BB;">zero-t</span> (<span style="color: #DFAF8F;">succ-c</span> <span style="color: #DFAF8F;">zero-c</span>)
    <span style="color: #7CB8BB;">succ-t</span> (nat-mul n (<span style="color: #7CB8BB;">recur</span> n.prev))
</pre>
</div>
</div>
</div>

<div id="outline-container-org20ed3e3" class="outline-3">
<h3 id="org20ed3e3">nat-even-p</h3>
<div class="outline-text-3" id="text-org20ed3e3">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">nat-even-p</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">bool-t</span>
<span style="color: #7CB8BB;">nat-even-p</span> x <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">true-c</span>
    <span style="color: #7CB8BB;">succ-t</span> <span style="color: #F0DFAF; font-weight: bold;">case</span> x.prev
      <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">false-c</span>
      <span style="color: #7CB8BB;">succ-t</span> (<span style="color: #7CB8BB;">recur</span> x.prev.prev)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e9bc56" class="outline-3">
<h3 id="org6e9bc56">nat-even-t</h3>
<div class="outline-text-3" id="text-org6e9bc56">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">nat-even-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">nat-even-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-even-t</span> <span style="color: #7CB8BB;">even-plus-two-even-t</span>]
  nat <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>

<span style="color: #7CB8BB;">zero-even-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-even-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  nat <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  nat <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">zero-c</span>

<span style="color: #7CB8BB;">even-plus-two-even-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">even-plus-two-even-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  nat <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">nat-even-t</span> m)
  nat <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #DFAF8F;">succ-c</span> m))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5685f60" class="outline-3">
<h3 id="org5685f60">two-even</h3>
<div class="outline-text-3" id="text-org5685f60">
<div class="org-src-container">

<pre class="src src-cicada">two-even <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">nat-even-t</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #DFAF8F;">succ-c</span> <span style="color: #DFAF8F;">zero-c</span>)))
two-even <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">even-plus-two-even-c</span> <span style="color: #DFAF8F;">zero-even-c</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6473adb" class="outline-3">
<h3 id="org6473adb">nat-add-associative</h3>
<div class="outline-text-3" id="text-org6473adb">
<div class="org-src-container">

<pre class="src src-cicada">nat-add-associative <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> [x y z] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span>
       (nat-add (nat-add x y) z)
       (nat-add x (nat-add y z)))
nat-add-associative x y z <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">eqv-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y z))
</pre>
</div>
</div>
</div>

<div id="outline-container-org509db75" class="outline-3">
<h3 id="org509db75">nat-add-commutative</h3>
<div class="outline-text-3" id="text-org509db75">
<div class="org-src-container">

<pre class="src src-cicada">nat-add-commutative <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> [x y] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span>
       (nat-add x y)
       (nat-add y x))
nat-add-commutative x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> (nat-add-zero-commutative y)
    <span style="color: #7CB8BB;">succ-t</span>
      (eqv-compose
        (eqv-apply <span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y))
        (nat-add-succ-commutative y x.prev))
</pre>
</div>
</div>
</div>

<div id="outline-container-org64350d9" class="outline-3">
<h3 id="org64350d9">nat-add-zero-commutative</h3>
<div class="outline-text-3" id="text-org64350d9">
<div class="org-src-container">

<pre class="src src-cicada">nat-add-zero-commutative <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> x <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span>
       (nat-add <span style="color: #DFAF8F;">zero-c</span> x)
       (nat-add x <span style="color: #DFAF8F;">zero-c</span>))
nat-add-zero-commutative x <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">eqv-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d3a1dc" class="outline-3">
<h3 id="org7d3a1dc">nat-add-succ-commutative-1</h3>
<div class="outline-text-3" id="text-org7d3a1dc">
<div class="org-src-container">

<pre class="src src-cicada">nat-add-succ-commutative-1 <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> [x y] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span>
       (nat-add (<span style="color: #DFAF8F;">succ-c</span> x) y)
       (<span style="color: #DFAF8F;">succ-c</span> (nat-add x y)))
nat-add-succ-commutative-1 x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">eqv-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc5c69" class="outline-3">
<h3 id="org8cc5c69">nat-add-succ-commutative-2</h3>
<div class="outline-text-3" id="text-org8cc5c69">
<div class="org-src-container">

<pre class="src src-cicada">nat-add-succ-commutative-2 <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> [x y] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span>
       (nat-add y (<span style="color: #DFAF8F;">succ-c</span> x))
       (<span style="color: #DFAF8F;">succ-c</span> (nat-add x y)))
nat-add-succ-commutative-2 x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">eqv-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y))
</pre>
</div>
</div>
</div>
</div>
