src/prelude.org
*** list-t

    #+begin_src cicada
    list-t : type-tt
    list-t = data :> [null-t cons-t]
      t : type-tt

    null-t : type-tt
    null-t = data
      t : type-tt

    cons-t : type-tt
    cons-t = data
      t : type-tt
      car : t
      cdr : (list-t t)
    #+end_src

*** list-length

    #+begin_src cicada
    list-length : -- (list-t t) -> nat-t
    list-length list =
      case list
        null-t zero-c
        cons-t (succ-c (recur list.cdr))
    #+end_src

*** list-append

    #+begin_src cicada
    list-append : -- (list-t t) (list-t t) -> (list-t t)
    list-append ante succ =
      case ante
        null-t succ
        cons-t (cons-c ante.car (recur ante.cdr succ))
    #+end_src

*** list-map

    #+begin_src cicada
    list-map : -- (-- a -> b) (list-t a) -> (list-t b)
    list-map fun list =
      case list
        null-t list
        cons-t (cons-c (fun list.car) (recur fun list.cdr))
    #+end_src

*** list-remove-first

    #+begin_src cicada
    list-remove-first : -- t (list-t t) -> (list-t t)
    list-remove-first x list =
      case list
        null-t list
        cons-t
          if (eq-p list.car x)
          then list.cdr
          else (cons-c list.car (recur list.cdr x))
    #+end_src

*** list-length-t

    #+begin_src cicada
    list-length-t : type-tt
    list-length-t = data :> [zero-length-t succ-length-t]
      list : (list-t t)
      length : nat-t

    zero-length-t : type-tt
    zero-length-t = data
      list : (list-t t)
      length : nat-t
      list = null-c
      length = zero-c

    succ-length-t : type-tt
    succ-length-t = data
      list : (list-t t)
      length : nat-t
      prev : (list-length-t list length)
      list = (cons-c x list)
      length = (succ-c length)
    #+end_src

*** [note] `append` in prolog

    #+begin_src cicada
    note in prolog, we will have :
      append([], Succ, Succ).
      append([Car | Cdr], Succ, [Car | ResultCdr]):-
        append(Cdr, Succ, ResultCdr).
    #+end_src

*** list-append-t

    #+begin_src cicada
    list-append-t : type-tt
    list-append-t = data :> [zero-append-t succ-append-t]
      [ante succ result] : (list-t t)

    zero-append-t : type-tt
    zero-append-t = data
      [ante succ result] : (list-t t)
      ante = null-c
      result = succ

    succ-append-t : type-tt
    succ-append-t = data
      [ante succ result] : (list-t t)
      prev : (list-append-t cdr succ result-cdr)
      ante = (cons-c car cdr)
      result = (cons-c car result-cdr)
    #+end_src

* vect

