prelude.html

<div id="outline-container-org49b4ba3" class="outline-2">
<h2 id="org49b4ba3">list</h2>
<div class="outline-text-2" id="text-org49b4ba3">
</div><div id="outline-container-org6b01f7d" class="outline-3">
<h3 id="org6b01f7d">list-t</h3>
<div class="outline-text-3" id="text-org6b01f7d">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">list-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">list-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">null-t</span> <span style="color: #7CB8BB;">cons-t</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

<span style="color: #7CB8BB;">null-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">null-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

<span style="color: #7CB8BB;">cons-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">cons-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  car <span style="color: #DFAF8F;">:</span> t
  cdr <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3999cfb" class="outline-3">
<h3 id="org3999cfb">list-length</h3>
<div class="outline-text-3" id="text-org3999cfb">
<div class="org-src-container">

<pre class="src src-cicada">list-length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">list-t</span> t) <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">nat-t</span>
list-length list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB;">null-t</span> <span style="color: #DFAF8F;">zero-c</span>
    <span style="color: #7CB8BB;">cons-t</span> (<span style="color: #DFAF8F;">succ-c</span> (<span style="color: #7CB8BB;">recur</span> list.cdr))
</pre>
</div>
</div>
</div>

<div id="outline-container-org60c320" class="outline-3">
<h3 id="org60c320">list-append</h3>
<div class="outline-text-3" id="text-org60c320">
<div class="org-src-container">

<pre class="src src-cicada">list-append <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">list-t</span> t) (<span style="color: #7CB8BB;">list-t</span> t) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">list-t</span> t)
list-append ante succ <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> ante
    <span style="color: #7CB8BB;">null-t</span> succ
    <span style="color: #7CB8BB;">cons-t</span> (<span style="color: #DFAF8F;">cons-c</span> ante.car (<span style="color: #7CB8BB;">recur</span> ante.cdr succ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff6165e" class="outline-3">
<h3 id="orgff6165e">list-map</h3>
<div class="outline-text-3" id="text-orgff6165e">
<div class="org-src-container">

<pre class="src src-cicada">list-map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b) (<span style="color: #7CB8BB;">list-t</span> a) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">list-t</span> b)
list-map fun list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB;">null-t</span> list
    <span style="color: #7CB8BB;">cons-t</span> (<span style="color: #DFAF8F;">cons-c</span> (fun list.car) (<span style="color: #7CB8BB;">recur</span> fun list.cdr))
</pre>
</div>
</div>
</div>

<div id="outline-container-org15ae56e" class="outline-3">
<h3 id="org15ae56e">list-remove-first</h3>
<div class="outline-text-3" id="text-org15ae56e">
<div class="org-src-container">

<pre class="src src-cicada">list-remove-first <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> t (<span style="color: #7CB8BB;">list-t</span> t) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">list-t</span> t)
list-remove-first x list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB;">null-t</span> list
    <span style="color: #7CB8BB;">cons-t</span>
      <span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #7CB8BB;">eq-p</span> list.car x)
      <span style="color: #F0DFAF; font-weight: bold;">then</span> list.cdr
      <span style="color: #F0DFAF; font-weight: bold;">else</span> (<span style="color: #DFAF8F;">cons-c</span> list.car (<span style="color: #7CB8BB;">recur</span> list.cdr x))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa58d0f" class="outline-3">
<h3 id="orgaa58d0f">list-length-t</h3>
<div class="outline-text-3" id="text-orgaa58d0f">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">list-length-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">list-length-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-length-t</span> <span style="color: #7CB8BB;">succ-length-t</span>]
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>

<span style="color: #7CB8BB;">zero-length-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-length-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  list <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">null-c</span>
  length <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">zero-c</span>

<span style="color: #7CB8BB;">succ-length-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">succ-length-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  list <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-length-t</span> list length)
  list <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> x list)
  length <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> length)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec0fa63" class="outline-3">
<h3 id="orgec0fa63"><span class="todo _note_">[note]</span> `append` in prolog</h3>
<div class="outline-text-3" id="text-orgec0fa63">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span> <span style="color: #F0DFAF; font-weight: bold;">in</span> prolog<span style="color: #F0DFAF; font-weight: bold;">,</span> we will have <span style="color: #DFAF8F;">:</span>
  append([]<span style="color: #F0DFAF; font-weight: bold;">,</span> <span style="color: #7CB8BB;">Succ</span><span style="color: #F0DFAF; font-weight: bold;">,</span> <span style="color: #7CB8BB;">Succ).</span>
  append([<span style="color: #7CB8BB;">Car</span> <span style="color: #7CB8BB;">|</span> <span style="color: #7CB8BB;">Cdr</span>]<span style="color: #F0DFAF; font-weight: bold;">,</span> <span style="color: #7CB8BB;">Succ</span><span style="color: #F0DFAF; font-weight: bold;">,</span> [<span style="color: #7CB8BB;">Car</span> <span style="color: #7CB8BB;">|</span> <span style="color: #7CB8BB;">ResultCdr]):-</span>
    append(<span style="color: #7CB8BB;">Cdr</span><span style="color: #F0DFAF; font-weight: bold;">,</span> <span style="color: #7CB8BB;">Succ</span><span style="color: #F0DFAF; font-weight: bold;">,</span> <span style="color: #7CB8BB;">ResultCdr).</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org87979b1" class="outline-3">
<h3 id="org87979b1">list-append-t</h3>
<div class="outline-text-3" id="text-org87979b1">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">list-append-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">list-append-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-append-t</span> <span style="color: #7CB8BB;">succ-append-t</span>]
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> <span style="color: #7CB8BB;">t)</span>

<span style="color: #7CB8BB;">zero-append-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-append-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
  ante <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">null-c</span>
  result <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">succ</span>

<span style="color: #7CB8BB;">succ-append-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">succ-append-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [ante succ result] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-t</span> t)
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">list-append-t</span> cdr succ result-cdr)
  ante <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> car cdr)
  result <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> car result-cdr)
</pre>
</div>
</div>
</div>
</div>
