src/prelude.org
*** vect-t

    #+begin_src cicada
    vect-t : type-tt
    vect-t = data :> [null-vect-t cons-vect-tt]
      t : type-tt
      length : nat-t

    null-vect-t : type-tt
    null-vect-t = data
      t : type-tt
      length : nat-t
      length = zero-c

    cons-vect-t : type-tt
    cons-vect-t = data
      t : type-tt
      length : nat-t
      car : t
      cdr : (vect-t t length)
      length = (succ-c length)
    #+end_src

*** vect-append

    #+begin_src cicada
    vect-append :
      -- (vect-t t m)
         (vect-t t n)
      -> (vect-t t (nat-add m n))
    vect-append ante succ =
      case ante
        null-vect-t succ
        cons-vect-t (cons-vect-c ante.car (recur ante.cdr succ))
    #+end_src

*** vect-map

    #+begin_src cicada
    vect-map : -- (-- a -> b) (vect-t a n) -> (vect-t a n)
    vect-map fun list =
      case list
        null-vect-t list
        cons-vect-t (cons-vect-c (fun list.car) (recur fun list.cdr))
    #+end_src

* order

*** preorder-tt

    #+begin_src cicada
    note
      preorder is a thin category
      with at most one morphism from an object to another.

    preorder-tt : type-ttt
    preorder-tt = data
      element-t : type-tt

      pre-t :
        -- element-t element-t
        -> type-tt

      pre-reflexive :
        -- a :: element-t
        -> (pre-t a a)

      pre-transitive :
        -- (pre-t a b)
           (pre-t b c)
        -> (pre-t a c)
    #+end_src

*** partial-order-tt

    #+begin_src cicada
    partial-order-tt : type-ttt
    partial-order-tt = data <: [preorder-tt]
      element-eqv-t :
        -- element-t
           element-t
        -> type-tt
      pre-anti-symmetric :
        -- (pre-t a b)
           (pre-t b a)
        -> (element-eqv-t a b)
    #+end_src

*** eqv-relation-tt

    #+begin_src cicada
    eqv-relation-tt : type-ttt
    eqv-relation-tt = data <: [preorder-tt]
      pre-symmetric :
        -- (pre-t a b)
        -> (pre-t b a)
    #+end_src

*** total-order-tt

    #+begin_src cicada
    total-order-tt : type-ttt
    total-order-tt = data <: [partial-order-tt]
      pre-connex :
        -- [a b] : element-t
        -> (+ (pre-t a b) (pre-t b a))
    #+end_src

* unique

*** unique-tt

    #+begin_src cicada
    unique-tt : type-ttt
    unique-tt = data
      t : type-tt
      value : t
      underlying-eqv-t : (-- t t -> type-tt)
      condition-t : (-- t -> type-tt)

      unique-proof :
        * (condition-t value)
          -- another : t
             (condition-t another)
          -> (underlying-eqv-t value another)
    #+end_src

*** (unique)

    #+begin_src cicada
    (unique <t>
     of <value>
     under <underlying-eqv-t>
     such-that <condition-t>) = macro
      (unique-tt
        t = <t>
        value = <value>
        underlying-eqv-t = <underlying-eqv-t>
        condition-t = <condition-t>)
    #+end_src

* category

