prelude.html

<div id="outline-container-orgd23e4f3" class="outline-2">
<h2 id="orgd23e4f3">vect</h2>
<div class="outline-text-2" id="text-orgd23e4f3">
</div><div id="outline-container-org756209a" class="outline-3">
<h3 id="org756209a">vect-t</h3>
<div class="outline-text-3" id="text-org756209a">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">vect-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">vect-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">null-vect-t</span> <span style="color: #7CB8BB;">cons-vect-tt</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>

<span style="color: #7CB8BB;">null-vect-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">null-vect-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  length <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">zero-c</span>

<span style="color: #7CB8BB;">cons-vect-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">cons-vect-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  length <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  car <span style="color: #DFAF8F;">:</span> t
  cdr <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">vect-t</span> t length)
  length <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> length)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5d6e56" class="outline-3">
<h3 id="orge5d6e56">vect-append</h3>
<div class="outline-text-3" id="text-orge5d6e56">
<div class="org-src-container">

<pre class="src src-cicada">vect-append <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">vect-t</span> t m)
     (<span style="color: #7CB8BB;">vect-t</span> t n)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">vect-t</span> t (nat-add m n))
vect-append ante succ <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> ante
    <span style="color: #7CB8BB;">null-vect-t</span> succ
    <span style="color: #7CB8BB;">cons-vect-t</span> (<span style="color: #DFAF8F;">cons-vect-c</span> ante.car (<span style="color: #7CB8BB;">recur</span> ante.cdr succ))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6101ae0" class="outline-3">
<h3 id="org6101ae0">vect-map</h3>
<div class="outline-text-3" id="text-org6101ae0">
<div class="org-src-container">

<pre class="src src-cicada">vect-map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b) (<span style="color: #7CB8BB;">vect-t</span> a n) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">vect-t</span> a n)
vect-map fun list <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> list
    <span style="color: #7CB8BB;">null-vect-t</span> list
    <span style="color: #7CB8BB;">cons-vect-t</span> (<span style="color: #DFAF8F;">cons-vect-c</span> (fun list.car) (<span style="color: #7CB8BB;">recur</span> fun list.cdr))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org238fe16" class="outline-2">
<h2 id="org238fe16">order</h2>
<div class="outline-text-2" id="text-org238fe16">
</div><div id="outline-container-orgd747a9" class="outline-3">
<h3 id="orgd747a9">preorder-tt</h3>
<div class="outline-text-3" id="text-orgd747a9">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  preorder is a thin category
  with at most one morphism from an object to <span style="color: #7CB8BB;">another.</span>

<span style="color: #7CB8BB;">preorder-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">preorder-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">element-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

  <span style="color: #7CB8BB;">pre-t</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">element-t</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>

  pre-reflexive <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">pre-t</span> a a)

  pre-transitive <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">pre-t</span> a b)
       (<span style="color: #7CB8BB;">pre-t</span> b c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">pre-t</span> a c)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd326f36" class="outline-3">
<h3 id="orgd326f36">partial-order-tt</h3>
<div class="outline-text-3" id="text-orgd326f36">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">partial-order-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">partial-order-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">preorder-tt</span>]
  <span style="color: #7CB8BB;">element-eqv-t</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">element-t</span>
       <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
  pre-anti-symmetric <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">pre-t</span> a b)
       (<span style="color: #7CB8BB;">pre-t</span> b a)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">element-eqv-t</span> a b)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3795291" class="outline-3">
<h3 id="org3795291">eqv-relation-tt</h3>
<div class="outline-text-3" id="text-org3795291">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">eqv-relation-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">eqv-relation-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">preorder-tt</span>]
  pre-symmetric <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">pre-t</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">pre-t</span> b a)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd15b0a1" class="outline-3">
<h3 id="orgd15b0a1">total-order-tt</h3>
<div class="outline-text-3" id="text-orgd15b0a1">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">total-order-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">total-order-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">partial-order-tt</span>]
  pre-connex <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> [a b] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">+</span> (<span style="color: #7CB8BB;">pre-t</span> a b) (<span style="color: #7CB8BB;">pre-t</span> b a))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5caacc" class="outline-2">
<h2 id="orgb5caacc">unique</h2>
<div class="outline-text-2" id="text-orgb5caacc">
</div><div id="outline-container-orge9b7f21" class="outline-3">
<h3 id="orge9b7f21">unique-tt</h3>
<div class="outline-text-3" id="text-orge9b7f21">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">unique-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">unique-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  value <span style="color: #DFAF8F;">:</span> t
  <span style="color: #7CB8BB;">underlying-eqv-t</span> <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">--</span> t t <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>)
  <span style="color: #7CB8BB;">condition-t</span> <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">--</span> t <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>)

  unique-proof <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #7CB8BB;">condition-t</span> value)
      <span style="color: #7CB8BB;">--</span> another <span style="color: #DFAF8F;">:</span> t
         (<span style="color: #7CB8BB;">condition-t</span> another)
      <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">underlying-eqv-t</span> value another)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c19adf" class="outline-3">
<h3 id="org6c19adf">(unique)</h3>
<div class="outline-text-3" id="text-org6c19adf">
<div class="org-src-container">

<pre class="src src-cicada">(<span style="color: #F0DFAF; font-weight: bold;">unique</span> <span style="color: #7CB8BB;">&lt;t&gt;</span>
 <span style="color: #F0DFAF; font-weight: bold;">of</span> <span style="color: #7CB8BB;">&lt;value&gt;</span>
 <span style="color: #F0DFAF; font-weight: bold;">under</span> <span style="color: #7CB8BB;">&lt;underlying-eqv-t&gt;</span>
 <span style="color: #F0DFAF; font-weight: bold;">such-that</span> <span style="color: #7CB8BB;">&lt;condition-t&gt;</span>) <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">macro</span>
  (<span style="color: #7CB8BB;">unique-tt</span>
    t <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">&lt;t&gt;</span>
    value <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">&lt;value&gt;</span>
    <span style="color: #7CB8BB;">underlying-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">&lt;underlying-eqv-t&gt;</span>
    <span style="color: #7CB8BB;">condition-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">&lt;condition-t&gt;</span>)
</pre>
</div>
</div>
</div>
</div>
