src/prelude.org
*** category-ttt

    #+begin_src cicada
    category-ttt : type-tttt
    category-ttt = data
      object-tt : type-ttt
      arrow-tt : -- object-tt object-tt -> type-ttt
      arrow-eqv-tt : -- (arrow-tt a b) (arrow-tt a b) -> type-ttt

      identity : -- a :: object-tt -> (arrow-tt a a)

      compose : -- (arrow-tt a b) (arrow-tt b c) -> (arrow-tt a c)

      identity-neutral-left :
        -- f : (arrow-tt a b)
        -> (arrow-eqv-tt f (compose identity f))

      identity-neutral-right :
        -- f : (arrow-tt a b)
        -> (arrow-eqv-tt f (compose f identity))

      compose-associative :
        -- f : (arrow-tt a b)
           g : (arrow-tt b c)
           h : (arrow-tt c d)
        -> (arrow-eqv-tt
             (compose f (compose g h))
             (compose (compose f g) h))

      arrow-eqv-relation :
        -- [a b] :: object-tt
        -> (eqv-relation-tt
             element-tt = (arrow-tt a b)
             pre-tt = arrow-eqv-tt)
    #+end_src

*** basic relation

***** category.isomorphic-tt

      #+begin_src cicada
      category.isomorphic-tt : type-ttt
      category.isomorphic-tt = data
        [lhs rhs] : object-tt
        iso : (arrow-tt lhs rhs)
        inv : (arrow-tt rhs lhs)
        iso-inv-identity : (arrow-eqv-tt (compose iso inv) identity)
        inv-iso-identity : (arrow-eqv-tt (compose inv iso) identity)
      #+end_src

*** universal construction

***** category.initial-tt

      #+begin_src cicada
      category.initial-tt : type-ttt
      category.initial-tt = data
        initial : object-tt
        factorizer :
          -- cand : object-tt
          -> factor : (arrow-tt initial cand)
      #+end_src

***** category.terminal-tt

      #+begin_src cicada
      category.terminal-tt : type-ttt
      category.terminal-tt = data <: [terminal-candidate-tt]
        terminal : object-tt
        factorizer :
          -- cand : object-tt
          -> factor : (arrow-tt cand terminal)
      #+end_src

***** category.product-tt

      #+begin_src cicada
      category.product-candidate-tt : type-ttt
      category.product-candidate-tt = data
        fst : object-tt
        snd : object-tt
        product : object-tt
        fst-projection : (arrow-tt product fst)
        snd-projection : (arrow-tt product snd)

      category.product-tt : type-ttt
      category.product-tt = data <: [product-candidate-tt]
        factorizer :
          -- cand : (product-candidate-tt fst snd)
          -> factor : (arrow-tt cand.product product)
        unique-factor :
          -- cand : (product-candidate-tt fst snd)
          -> unique (factorizer cand)
             of (arrow-tt cand.product product)
             under arrow-eqv-tt
             such-that
               (arrow-eqv-tt
                 cand.fst-projection
                 (compose factor fst-projection))
               (arrow-eqv-tt
                 cand.snd-projection
                 (compose factor snd-projection))
      #+end_src

