prelude.html

<div id="outline-container-orgea5e7fd" class="outline-2">
<h2 id="orgea5e7fd">category</h2>
<div class="outline-text-2" id="text-orgea5e7fd">
</div><div id="outline-container-org18a60c7" class="outline-3">
<h3 id="org18a60c7">category-ttt</h3>
<div class="outline-text-3" id="text-org18a60c7">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tttt</span>
<span style="color: #7CB8BB;">category-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">object-tt</span> <span style="color: #7CB8BB;">object-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-eqv-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b) (<span style="color: #7CB8BB;">arrow-tt</span> a b) <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>

  identity <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">object-tt</span> <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-tt</span> a a)

  compose <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b) (<span style="color: #7CB8BB;">arrow-tt</span> b c) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-tt</span> a c)

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> f (compose identity f))

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> f (compose f identity))

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> c d)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
         (compose f (compose g h))
         (compose (compose f g) h))

  arrow-eqv-relation <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> [a b] <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-relation-tt</span>
         <span style="color: #7CB8BB;">element-tt</span> <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b)
         <span style="color: #7CB8BB;">pre-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">arrow-eqv-tt</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2e6230" class="outline-3">
<h3 id="orgd2e6230">basic relation</h3>
<div class="outline-text-3" id="text-orgd2e6230">
</div><div id="outline-container-org1113572" class="outline-4">
<h4 id="org1113572">category.isomorphic-tt</h4>
<div class="outline-text-4" id="text-org1113572">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category.isomorphic-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.isomorphic-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  iso <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> lhs rhs)
  inv <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> rhs lhs)
  iso-inv-identity <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> (compose iso inv) identity)
  inv-iso-identity <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> (compose inv iso) identity)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb8ec921" class="outline-3">
<h3 id="orgb8ec921">universal construction</h3>
<div class="outline-text-3" id="text-orgb8ec921">
</div><div id="outline-container-orge40e4c4" class="outline-4">
<h4 id="orge40e4c4">category.initial-tt</h4>
<div class="outline-text-4" id="text-orge40e4c4">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category.initial-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.initial-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  initial <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> initial cand)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7fdd97" class="outline-4">
<h4 id="orge7fdd97">category.terminal-tt</h4>
<div class="outline-text-4" id="text-orge7fdd97">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category.terminal-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.terminal-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">terminal-candidate-tt</span>]
  terminal <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> cand terminal)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4a48fa" class="outline-4">
<h4 id="orge4a48fa">category.product-tt</h4>
<div class="outline-text-4" id="text-orge4a48fa">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category.product-candidate-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.product-candidate-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  fst <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  snd <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  product <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  fst-projection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> product fst)
  snd-projection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> product <span style="color: #7CB8BB;">snd)</span>

<span style="color: #7CB8BB;">category.product-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.product-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">product-candidate-tt</span>]
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">product-candidate-tt</span> fst snd)
    <span style="color: #7CB8BB;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> cand.product product)
  unique-factor <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">product-candidate-tt</span> fst snd)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #F0DFAF; font-weight: bold;">unique</span> (factorizer cand)
       <span style="color: #F0DFAF; font-weight: bold;">of</span> (<span style="color: #7CB8BB;">arrow-tt</span> cand.product product)
       <span style="color: #F0DFAF; font-weight: bold;">under</span> <span style="color: #7CB8BB;">arrow-eqv-tt</span>
       <span style="color: #F0DFAF; font-weight: bold;">such-that</span>
         (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
           cand.fst-projection
           (compose factor fst-projection))
         (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
           cand.snd-projection
           (compose factor snd-projection))
</pre>
</div>
</div>
</div>
