src/prelude.org
***** category.sum-tt

      #+begin_src cicada
      category.sum-candidate-tt : type-ttt
      category.sum-candidate-tt = data
        fst : object-tt
        snd : object-tt
        sum : object-tt
        fst-injection : (arrow-tt fst sum)
        snd-injection : (arrow-tt snd sum)

      category.sum-tt : type-ttt
      category.sum-tt = data <: [sum-candidate-tt]
        factorizer :
          -- cand : (sum-candidate-tt fst snd)
          -> factor : (arrow-tt sum cand.sum)
        unique-factor :
          -- cand : (sum-candidate-tt fst snd)
          -> unique (factorizer cand)
             of (arrow-tt sum cand.sum)
             under arrow-eqv-tt
             such-that
               (arrow-eqv-tt
                 cand.fst-injection
                 (compose fst-injection factor))
               (arrow-eqv-tt
                 cand.snd-injection
                 (compose snd-injection factor))
      #+end_src

*** other structure as category

***** preorder.as-category

      #+begin_src cicada
      note
        to view a preorder as a category
        we simple view all arrow of the same type as eqv

      preorder.as-category : category-tt
      preorder.as-category = category-cc
        object-t = element-t

        arrow-t = pre-t

        arrow-eqv-t _ _ = unit-t

        identity = pre-reflexive

        compose = pre-transitive

        identity-neutral-left _ = unit-c

        identity-neutral-right _ = unit-c

        compose-associative _ _ _ = unit-c
      #+end_src

*** build new category from old category

***** category.opposite

      #+begin_src cicada
      category.opposite : category-ttt
      category.opposite = category-ccc
        object-tt = this.object-tt

        arrow-tt :
          -- object-tt object-tt
          -> type-tt
        arrow-tt a b = this.arrow-tt b a

        arrow-eqv-tt :
          -- (this.arrow-tt b a) (this.arrow-tt b a)
          -> type-tt
        arrow-eqv-tt = this.arrow-eqv-tt

        identity :
          -- a :: object-tt
          -> (arrow-tt a a)
        identity = this.identity

        compose :
          -- (this.arrow-tt b a)
             (this.arrow-tt c b)
          -> (this.arrow-tt c a)
        compose f g = this.compose g f

        identity-neutral-left :
          -- f : (this.arrow-tt b a)
          -> (arrow-eqv-tt f (this.compose f identity))
        identity-neutral-left = this.identity-neutral-right

        identity-neutral-right :
          -- f : (this.arrow-tt b a)
          -> (arrow-eqv-tt f (this.compose identity f))
        identity-neutral-right = this.identity-neutral-left

        compose-associative :
          -- f : (this.arrow-tt b a)
             g : (this.arrow-tt c b)
             h : (this.arrow-tt d c)
          -> (arrow-eqv-tt
               (this.compose (this.compose h g) f)
               (this.compose h (this.compose g f)))
        compose-associative f g h =
          (this.arrow-eqv-relation.pre-symmetric
            (this.compose-associative h g f))
      #+end_src

***** category-product

      #+begin_src cicada
      category-product : -- category-ttt category-ttt -> category-ttt
      category-product #1 #2 = category-ccc
        object-tt = * #1.object-tt #2.object-tt

        arrow-tt a b =
          * (#1.arrow-tt a.1 b.1)
            (#2.arrow-tt a.2 b.2)

        arrow-eqv-tt lhs rhs =
          * (#1.arrow-eqv-tt lhs.1 rhs.1)
            (#2.arrow-eqv-tt lhs.2 rhs.2)

        identity =
          * #1.identity
            #2.identity

        compose f g =
          * (#1.compose f.1 g.1)
            (#2.compose f.2 g.2)

        identity-neutral-left f =
          * (#1.identity-neutral-left f.1)
            (#2.identity-neutral-left f.2)

        identity-neutral-right f =
          * (#1.identity-neutral-right f.1)
            (#2.identity-neutral-right f.2)

        compose-associative f g h =
          * (#1.compose-associative f.1 g.1 h.1)
            (#2.compose-associative f.2 g.2 h.2)
      #+end_src

* product-closed-category

