prelude.html

<div id="outline-container-org118a8a8" class="outline-4">
<h4 id="org118a8a8">category.sum-tt</h4>
<div class="outline-text-4" id="text-org118a8a8">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">category.sum-candidate-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.sum-candidate-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  fst <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  snd <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  sum <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  fst-injection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> fst sum)
  snd-injection <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> snd <span style="color: #7CB8BB;">sum)</span>

<span style="color: #7CB8BB;">category.sum-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.sum-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">sum-candidate-tt</span>]
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">sum-candidate-tt</span> fst snd)
    <span style="color: #7CB8BB;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> sum cand.sum)
  unique-factor <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">sum-candidate-tt</span> fst snd)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #F0DFAF; font-weight: bold;">unique</span> (factorizer cand)
       <span style="color: #F0DFAF; font-weight: bold;">of</span> (<span style="color: #7CB8BB;">arrow-tt</span> sum cand.sum)
       <span style="color: #F0DFAF; font-weight: bold;">under</span> <span style="color: #7CB8BB;">arrow-eqv-tt</span>
       <span style="color: #F0DFAF; font-weight: bold;">such-that</span>
         (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
           cand.fst-injection
           (compose fst-injection factor))
         (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
           cand.snd-injection
           (compose snd-injection factor))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org53d3082" class="outline-3">
<h3 id="org53d3082">other structure as category</h3>
<div class="outline-text-3" id="text-org53d3082">
</div><div id="outline-container-org4dfc440" class="outline-4">
<h4 id="org4dfc440">preorder.as-category</h4>
<div class="outline-text-4" id="text-org4dfc440">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  to view a preorder <span style="color: #F0DFAF; font-weight: bold;">as</span> a category
  we simple view all arrow <span style="color: #F0DFAF; font-weight: bold;">of</span> the same <span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #F0DFAF; font-weight: bold;">as</span> eqv

preorder.as-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tt</span>
preorder.as-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cc</span>
  <span style="color: #7CB8BB;">object-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">element-t</span>

  <span style="color: #7CB8BB;">arrow-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">pre-t</span>

  <span style="color: #7CB8BB;">arrow-eqv-t</span> _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">unit-t</span>

  identity <span style="color: #DFAF8F;">=</span> pre-reflexive

  compose <span style="color: #DFAF8F;">=</span> pre-transitive

  identity-neutral-left _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">unit-c</span>

  identity-neutral-right _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">unit-c</span>

  compose-associative _ _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">unit-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf5b7620" class="outline-3">
<h3 id="orgf5b7620">build new category from old category</h3>
<div class="outline-text-3" id="text-orgf5b7620">
</div><div id="outline-container-org1d9f42d" class="outline-4">
<h4 id="org1d9f42d">category.opposite</h4>
<div class="outline-text-4" id="text-org1d9f42d">
<div class="org-src-container">

<pre class="src src-cicada">category.opposite <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>
category.opposite <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-ccc</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">this.object-tt</span>

  <span style="color: #7CB8BB;">arrow-tt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">object-tt</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
  <span style="color: #7CB8BB;">arrow-tt</span> a b <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">this.arrow-tt</span> b a

  <span style="color: #7CB8BB;">arrow-eqv-tt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> b a) (<span style="color: #7CB8BB;">this.arrow-tt</span> b a)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
  <span style="color: #7CB8BB;">arrow-eqv-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">this.arrow-eqv-tt</span>

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-tt</span> a a)
  identity <span style="color: #DFAF8F;">=</span> this.identity

  compose <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> b a)
       (<span style="color: #7CB8BB;">this.arrow-tt</span> c b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> c a)
  compose f g <span style="color: #DFAF8F;">=</span> this.compose g f

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> b a)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> f (this.compose f identity))
  identity-neutral-left <span style="color: #DFAF8F;">=</span> this.identity-neutral-right

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> b a)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span> f (this.compose identity f))
  identity-neutral-right <span style="color: #DFAF8F;">=</span> this.identity-neutral-left

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> b a)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> c b)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">this.arrow-tt</span> d c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
         (this.compose (this.compose h g) f)
         (this.compose h (this.compose g f)))
  compose-associative f g h <span style="color: #DFAF8F;">=</span>
    (this.arrow-eqv-relation.pre-symmetric
      (this.compose-associative h g f))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2485dba" class="outline-4">
<h4 id="org2485dba">category-product</h4>
<div class="outline-text-4" id="text-org2485dba">
<div class="org-src-container">

<pre class="src src-cicada">category-product <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">category-ttt</span> <span style="color: #7CB8BB;">category-ttt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">category-ttt</span>
category-product <span style="color: #BFEBBF;">#1</span> <span style="color: #BFEBBF;">#2</span> <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-ccc</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">*</span> <span style="color: #BFEBBF;">#1.object-tt</span> <span style="color: #BFEBBF;">#2.object-tt</span>

  <span style="color: #7CB8BB;">arrow-tt</span> a b <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.arrow-tt</span> a.1 b.1)
      (<span style="color: #BFEBBF;">#2.arrow-tt</span> a.2 b.2)

  <span style="color: #7CB8BB;">arrow-eqv-tt</span> lhs rhs <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.arrow-eqv-tt</span> lhs.1 rhs.1)
      (<span style="color: #BFEBBF;">#2.arrow-eqv-tt</span> lhs.2 rhs.2)

  identity <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> <span style="color: #BFEBBF;">#1.identity</span>
      <span style="color: #BFEBBF;">#2.identity</span>

  compose f g <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.compose</span> f.1 g.1)
      (<span style="color: #BFEBBF;">#2.compose</span> f.2 g.2)

  identity-neutral-left f <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.identity-neutral-left</span> f.1)
      (<span style="color: #BFEBBF;">#2.identity-neutral-left</span> f.2)

  identity-neutral-right f <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.identity-neutral-right</span> f.1)
      (<span style="color: #BFEBBF;">#2.identity-neutral-right</span> f.2)

  compose-associative f g h <span style="color: #DFAF8F;">=</span>
    <span style="color: #7CB8BB;">*</span> (<span style="color: #BFEBBF;">#1.compose-associative</span> f.1 g.1 h.1)
      (<span style="color: #BFEBBF;">#2.compose-associative</span> f.2 g.2 h.2)
</pre>
</div>
</div>
</div>
</div>
</div>
