src/prelude.org
*** product-closed-category-ttt

    #+begin_src cicada
    product-closed-category-ttt : type-tttt
    product-closed-category-ttt = data <: [category-ttt]
      product :
        -- [a b] : object-tt
        -> p : object-tt
           product-relation :: (product-tt a b p)
    #+end_src

*** product-closed-category.product-arrow

    #+begin_src cicada
    product-closed-category.product-arrow :
      -- (arrow-tt a b)
         (arrow-tt c d)
      -> (arrow-tt (product a c) (product b d))
    product-closed-category.product-arrow f g =
      with-details (product a c)
        p <- product-relation
      with-details (product b d)
        q <- product-relation
      (q.factorizer
        (product-candidate-cc
          fst = b
          snd = d
          product = (product a c)
          fst-projection = (compose p.fst-projection f)
          snd-projection = (compose p.fst-projection g)))
    #+end_src

*** product-closed-category.exponential-tt

    #+begin_src cicada
    product-closed-category.exponential-candidate-tt : type-ttt
    product-closed-category.exponential-candidate-tt = data
      ante : object-tt
      succ : object-tt
      exponential : object-tt
      eval : (arrow-tt (product exponential ante) succ)

    category.exponential-tt : type-ttt
    category.exponential-tt = data <: [exponential-candidate-tt]
      factorizer :
        -- cand : (exponential-candidate-tt ante succ)
        -> factor : (arrow-tt cand.exponential exponential)
      unique-factor :
        -- cand : (exponential-candidate-tt ante succ)
        -> unique (factorizer cand)
           of (arrow-tt cand.exponential exponential)
           under arrow-eqv-tt
           such-that
             (arrow-eqv-tt
               cand.eval
               (compose eval (product-arrow factor identity)))
    #+end_src

* [todo] cartesian-closed-category

* void-category

*** void-arrow-t

    #+begin_src cicada
    void-arrow-t : type-tt
    void-arrow-t = data
      [ante succ] : void-t
    #+end_src

*** void-arrow-eqv-t

    #+begin_src cicada
    void-arrow-eqv-t : type-tt
    void-arrow-eqv-t = data
      [lhs rhs] : (void-arrow-t a b)
    #+end_src

*** void-category

    #+begin_src cicada
    void-category : category-tt
    void-category = category-cc
      object-t = void-t
      arrow-t = void-arrow-t
      arrow-eqv-t = void-arrow-eqv-t

      identity :
        -- a :: void-t
        -> (void-arrow-t a a)
      identity _ = void-arrow-c

      compose _ _ = void-arrow-c

      identity-neutral-left :
        -- f : (void-arrow-t a b)
        -> (void-arrow-eqv-t f void-arrow-c)
      identity-neutral-left _ = void-arrow-eqv-c

      identity-neutral-right :
        -- f : (void-arrow-t a b)
        -> (void-arrow-eqv-t f void-arrow-c)
      identity-neutral-right _ = void-arrow-eqv-c

      compose-associative :
        -- f : (void-arrow-t a b)
           g : (void-arrow-t b c)
           h : (void-arrow-t c d)
        -> (void-arrow-eqv-t void-arrow-eqv-c void-arrow-eqv-c)
      compose-associative _ _ _ = void-arrow-eqv-c
    #+end_src

* graph-tt

*** graph-tt

    #+begin_src cicada
    note
      different between graph and category is that,
      composing [linking] two edges does not give you edge but path.

    graph-tt : type-ttt
    graph-tt = data
      node-t : type-tt
      edge-t : -- node-t node-t -> type-tt
    #+end_src

