prelude.html

<div id="outline-container-org3480eee" class="outline-2">
<h2 id="org3480eee">product-closed-category</h2>
<div class="outline-text-2" id="text-org3480eee">
</div><div id="outline-container-org415737a" class="outline-3">
<h3 id="org415737a">product-closed-category-ttt</h3>
<div class="outline-text-3" id="text-org415737a">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">product-closed-category-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tttt</span>
<span style="color: #7CB8BB;">product-closed-category-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">category-ttt</span>]
  product <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> [a b] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> p <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
       product-relation <span style="color: #BFEBBF;">::</span> (<span style="color: #7CB8BB;">product-tt</span> a b p)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d5cc8c" class="outline-3">
<h3 id="org6d5cc8c">product-closed-category.product-arrow</h3>
<div class="outline-text-3" id="text-org6d5cc8c">
<div class="org-src-container">

<pre class="src src-cicada">product-closed-category.product-arrow <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b)
     (<span style="color: #7CB8BB;">arrow-tt</span> c d)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">arrow-tt</span> (product a c) (product b d))
product-closed-category.product-arrow f g <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">with-details</span> (product a c)
    p <span style="color: #7CB8BB;">&lt;-</span> product-relation
  <span style="color: #F0DFAF; font-weight: bold;">with-details</span> (product b d)
    q <span style="color: #7CB8BB;">&lt;-</span> product-relation
  (q.factorizer
    (<span style="color: #DFAF8F;">product-candidate-cc</span>
      fst <span style="color: #DFAF8F;">=</span> b
      snd <span style="color: #DFAF8F;">=</span> d
      product <span style="color: #DFAF8F;">=</span> (product a c)
      fst-projection <span style="color: #DFAF8F;">=</span> (compose p.fst-projection f)
      snd-projection <span style="color: #DFAF8F;">=</span> (compose p.fst-projection g)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org6dc5bb2" class="outline-3">
<h3 id="org6dc5bb2">product-closed-category.exponential-tt</h3>
<div class="outline-text-3" id="text-org6dc5bb2">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">product-closed-category.exponential-candidate-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">product-closed-category.exponential-candidate-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  ante <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  succ <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  exponential <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">object-tt</span>
  eval <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> (product exponential ante) <span style="color: #7CB8BB;">succ)</span>

<span style="color: #7CB8BB;">category.exponential-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">category.exponential-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">exponential-candidate-tt</span>]
  factorizer <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">exponential-candidate-tt</span> ante succ)
    <span style="color: #7CB8BB;">-&gt;</span> factor <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> cand.exponential exponential)
  unique-factor <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> cand <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">exponential-candidate-tt</span> ante succ)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #F0DFAF; font-weight: bold;">unique</span> (factorizer cand)
       <span style="color: #F0DFAF; font-weight: bold;">of</span> (<span style="color: #7CB8BB;">arrow-tt</span> cand.exponential exponential)
       <span style="color: #F0DFAF; font-weight: bold;">under</span> <span style="color: #7CB8BB;">arrow-eqv-tt</span>
       <span style="color: #F0DFAF; font-weight: bold;">such-that</span>
         (<span style="color: #7CB8BB;">arrow-eqv-tt</span>
           cand.eval
           (compose eval (product-arrow factor identity)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org514ee00" class="outline-2">
<h2 id="org514ee00"><span class="done _todo_">[todo]</span> cartesian-closed-category</h2>
</div>

<div id="outline-container-org322256d" class="outline-2">
<h2 id="org322256d">void-category</h2>
<div class="outline-text-2" id="text-org322256d">
</div><div id="outline-container-orgbd7d748" class="outline-3">
<h3 id="orgbd7d748">void-arrow-t</h3>
<div class="outline-text-3" id="text-orgbd7d748">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">void-arrow-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">void-arrow-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [ante succ] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">void-t</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbf8d79" class="outline-3">
<h3 id="orgfbf8d79">void-arrow-eqv-t</h3>
<div class="outline-text-3" id="text-orgfbf8d79">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">void-arrow-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">void-arrow-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> a b)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d010da" class="outline-3">
<h3 id="org9d010da">void-category</h3>
<div class="outline-text-3" id="text-org9d010da">
<div class="org-src-container">

<pre class="src src-cicada">void-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tt</span>
void-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cc</span>
  <span style="color: #7CB8BB;">object-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">void-t</span>
  <span style="color: #7CB8BB;">arrow-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">void-arrow-t</span>
  <span style="color: #7CB8BB;">arrow-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">void-arrow-eqv-t</span>

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">void-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">void-arrow-t</span> a a)
  identity _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">void-arrow-c</span>

  compose _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">void-arrow-c</span>

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">void-arrow-eqv-t</span> f <span style="color: #DFAF8F;">void-arrow-c</span>)
  identity-neutral-left _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">void-arrow-eqv-c</span>

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">void-arrow-eqv-t</span> f <span style="color: #DFAF8F;">void-arrow-c</span>)
  identity-neutral-right _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">void-arrow-eqv-c</span>

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">void-arrow-t</span> c d)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">void-arrow-eqv-t</span> <span style="color: #DFAF8F;">void-arrow-eqv-c</span> <span style="color: #DFAF8F;">void-arrow-eqv-c</span>)
  compose-associative _ _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">void-arrow-eqv-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6185284" class="outline-2">
<h2 id="org6185284">graph-tt</h2>
<div class="outline-text-2" id="text-org6185284">
</div><div id="outline-container-org41c24d2" class="outline-3">
<h3 id="org41c24d2">graph-tt</h3>
<div class="outline-text-3" id="text-org41c24d2">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  different between graph and category is that<span style="color: #F0DFAF; font-weight: bold;">,</span>
  composing [linking] two edges does not <span style="color: #F0DFAF; font-weight: bold;">give</span> you edge but <span style="color: #7CB8BB;">path.</span>

<span style="color: #7CB8BB;">graph-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">graph-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">node-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  <span style="color: #7CB8BB;">edge-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">node-t</span> <span style="color: #7CB8BB;">node-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
</pre>
</div>
</div>
</div>
