src/prelude.org
*** graph.path-t

    #+begin_src cicada
    graph.path-t : type-tt
    graph.path-t = data
      :> [node-path-t
          edge-path-t
          link-path-t]
      [start end] : node-t

    graph.node-path-t : type-tt
    graph.node-path-t = data
      [start end] : node-t
      node : node-t
      start = node
      end = node

    graph.edge-path-t : type-tt
    graph.edge-path-t = data
      [start end] : node-t
      edge : (edge-t start end)

    graph.link-path-t : type-tt
    graph.link-path-t = data
      [start end] : node-t
      first : (path-t start middle)
      next : (path-t middle end)
    #+end_src

*** graph.path-eqv-t

    #+begin_src cicada
    graph.path-eqv-t : type-tt
    graph.path-eqv-t = data
      :> [refl-path-eqv-t
          node-left-path-eqv-t
          node-right-path-eqv-t
          associative-path-eqv-t]
      [lhs rhs] : (path-t a b)

    graph.refl-path-eqv-t : type-tt
    graph.refl-path-eqv-t = data
      [lhs rhs] : (path-t a b)
      p : (path-t a b)
      lhs = p
      lhs = p

    graph.node-left-path-eqv-t : type-tt
    graph.node-left-path-eqv-t = data
      [lhs rhs] : (path-t a b)
      p : (path-t a b)
      lhs = p
      rhs = (link-path-c (node-path-c a) p)

    graph.node-right-path-eqv-t : type-tt
    graph.node-right-path-eqv-t = data
      [lhs rhs] : (path-t a b)
      p : (path-t a b)
      lhs = p
      rhs = (link-path-c p (node-path-c b))

    graph.associative-path-eqv-t : type-tt
    graph.associative-path-eqv-t = data
      [lhs rhs] : (path-t a b)
      p : (path-t a b)
      q : (path-t b c)
      r : (path-t c d)
      lhs = (link-path-c p (link-path-c q r))
      rhs = (link-path-c (link-path-c p q) r)
    #+end_src

*** graph.as-free-category

    #+begin_src cicada
    graph.as-free-category : category-tt
    graph.as-free-category = category-cc
      object-t = node-t
      arrow-t = path-t
      arrow-eqv-t = path-eqv-t

      identity :
        -- a :: node-t
        -> (path-t a a)
      identity = (node-path-c a)

      compose = link-path-c

      identity-neutral-left :
        -- f : (path-t a b)
        -> (path-eqv-t f (link-path-c (node-path-c a) f))
      identity-neutral-left = node-left-path-eqv-c

      identity-neutral-right :
        -- f : (path-t a b)
        -> (path-eqv-t f (link-path-c f (node-path-c b)))
      identity-neutral-right = node-right-path-eqv-c

      compose-associative :
        -- f : (path-t a b)
           g : (path-t b c)
           h : (path-t c d)
        -> (path-eqv-t
             (link-path-c f (link-path-c g h))
             (link-path-c (link-path-c f g) h))
      compose-associative = associative-path-eqv-c
    #+end_src

* nat-order-category

*** nat-lteq-t

    #+begin_src cicada
    nat-lteq-t : type-tt
    nat-lteq-t = data :> [zero-lteq-t succ-lteq-t]
      [l r] : nat-t

    zero-lteq-t : type-tt
    zero-lteq-t = data
      [l r] : nat-t
      l = zero-c

    succ-lteq-t : type-tt
    succ-lteq-t = data
      [l r] : nat-t
      prev : (nat-lteq-t x y)
      l = (succ-c x)
      r = (succ-c y)
    #+end_src

*** nat-non-negative

    #+begin_src cicada
    nat-non-negative : -- n : nat-t -> (nat-lteq-t zero-c n)
    nat-non-negative = zero-lteq-c
    #+end_src

