prelude.html

<div id="outline-container-org93494f" class="outline-3">
<h3 id="org93494f">graph.path-t</h3>
<div class="outline-text-3" id="text-org93494f">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">graph.path-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.path-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">node-path-t</span>
      <span style="color: #7CB8BB;">edge-path-t</span>
      <span style="color: #7CB8BB;">link-path-t</span>]
  [start end] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">node-t</span>

<span style="color: #7CB8BB;">graph.node-path-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.node-path-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [start end] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">node-t</span>
  node <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">node-t</span>
  start <span style="color: #DFAF8F;">=</span> node
  end <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">node</span>

<span style="color: #7CB8BB;">graph.edge-path-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.edge-path-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [start end] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">node-t</span>
  edge <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">edge-t</span> start <span style="color: #7CB8BB;">end)</span>

<span style="color: #7CB8BB;">graph.link-path-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.link-path-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [start end] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">node-t</span>
  first <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> start middle)
  next <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> middle end)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcdc5bc6" class="outline-3">
<h3 id="orgcdc5bc6">graph.path-eqv-t</h3>
<div class="outline-text-3" id="text-orgcdc5bc6">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">graph.path-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.path-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">refl-path-eqv-t</span>
      <span style="color: #7CB8BB;">node-left-path-eqv-t</span>
      <span style="color: #7CB8BB;">node-right-path-eqv-t</span>
      <span style="color: #7CB8BB;">associative-path-eqv-t</span>]
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a <span style="color: #7CB8BB;">b)</span>

<span style="color: #7CB8BB;">graph.refl-path-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.refl-path-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  p <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  lhs <span style="color: #DFAF8F;">=</span> p
  lhs <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">p</span>

<span style="color: #7CB8BB;">graph.node-left-path-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.node-left-path-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  p <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  lhs <span style="color: #DFAF8F;">=</span> p
  rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">link-path-c</span> (<span style="color: #DFAF8F;">node-path-c</span> a) <span style="color: #7CB8BB;">p)</span>

<span style="color: #7CB8BB;">graph.node-right-path-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.node-right-path-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  p <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  lhs <span style="color: #DFAF8F;">=</span> p
  rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">link-path-c</span> p (<span style="color: #DFAF8F;">node-path-c</span> <span style="color: #7CB8BB;">b))</span>

<span style="color: #7CB8BB;">graph.associative-path-eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">graph.associative-path-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [lhs rhs] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  p <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
  q <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> b c)
  r <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> c d)
  lhs <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">link-path-c</span> p (<span style="color: #DFAF8F;">link-path-c</span> q r))
  rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">link-path-c</span> (<span style="color: #DFAF8F;">link-path-c</span> p q) r)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9717f11" class="outline-3">
<h3 id="org9717f11">graph.as-free-category</h3>
<div class="outline-text-3" id="text-org9717f11">
<div class="org-src-container">

<pre class="src src-cicada">graph.as-free-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tt</span>
graph.as-free-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cc</span>
  <span style="color: #7CB8BB;">object-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">node-t</span>
  <span style="color: #7CB8BB;">arrow-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">path-t</span>
  <span style="color: #7CB8BB;">arrow-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">path-eqv-t</span>

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">node-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">path-t</span> a a)
  identity <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">node-path-c</span> a)

  compose <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">link-path-c</span>

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">path-eqv-t</span> f (<span style="color: #DFAF8F;">link-path-c</span> (<span style="color: #DFAF8F;">node-path-c</span> a) f))
  identity-neutral-left <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">node-left-path-eqv-c</span>

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">path-eqv-t</span> f (<span style="color: #DFAF8F;">link-path-c</span> f (<span style="color: #DFAF8F;">node-path-c</span> b)))
  identity-neutral-right <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">node-right-path-eqv-c</span>

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">path-t</span> c d)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">path-eqv-t</span>
         (<span style="color: #DFAF8F;">link-path-c</span> f (<span style="color: #DFAF8F;">link-path-c</span> g h))
         (<span style="color: #DFAF8F;">link-path-c</span> (<span style="color: #DFAF8F;">link-path-c</span> f g) h))
  compose-associative <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">associative-path-eqv-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf3ef4b3" class="outline-2">
<h2 id="orgf3ef4b3">nat-order-category</h2>
<div class="outline-text-2" id="text-orgf3ef4b3">
</div><div id="outline-container-org6d29813" class="outline-3">
<h3 id="org6d29813">nat-lteq-t</h3>
<div class="outline-text-3" id="text-org6d29813">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">nat-lteq-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">nat-lteq-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #7CB8BB;">succ-lteq-t</span>]
  [l r] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>

<span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [l r] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  l <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">zero-c</span>

<span style="color: #7CB8BB;">succ-lteq-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">succ-lteq-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [l r] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  prev <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> x y)
  l <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> x)
  r <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">succ-c</span> y)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a6a80b" class="outline-3">
<h3 id="org1a6a80b">nat-non-negative</h3>
<div class="outline-text-3" id="text-org1a6a80b">
<div class="org-src-container">

<pre class="src src-cicada">nat-non-negative <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> n <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> <span style="color: #DFAF8F;">zero-c</span> n)
nat-non-negative <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">zero-lteq-c</span>
</pre>
</div>
</div>
</div>
