src/prelude.org
*** nat-lteq-reflexive

    #+begin_src cicada
    nat-lteq-reflexive : -- n : nat-t -> (nat-lteq-t n n)
    nat-lteq-reflexive n =
      case n
        zero-t zero-lteq-c
        succ-t (succ-lteq-c (recur n.prev))
    #+end_src

*** nat-lteq-transitive

    #+begin_src cicada
    nat-lteq-transitive :
      -- (nat-lteq-t a b)
         (nat-lteq-t b c)
      -> (nat-lteq-t a c)
    nat-lteq-transitive x y =
      case x
        zero-lteq-t zero-lteq-c
        succ-lteq-t (succ-lteq-c (recur x.prev y.prev))
    #+end_src

*** nat-lt-t

    #+begin_src cicada
    nat-lt-t : -- nat-t nat-t -> type-tt
    nat-lt-t l r = (nat-lteq-t (succ-c l) r)
    #+end_src

*** nat-archimedean-property

    #+begin_src cicada
    nat-archimedean-property :
      -- x : nat-t
      -> (* y : nat-t
            (nat-lt-t x y))
    nat-archimedean-property x =
      (* (succ-c x) (nat-lteq-reflexive (succ-c x)))
    #+end_src

*** nat-order-category

    #+begin_src cicada
    nat-order-category : category-tt
    nat-order-category = category-cc
      object-t = nat-t
      arrow-t = nat-lteq-t
      arrow-eqv-t = eqv-t

      identity :
        -- a :: nat-t
        -> (nat-lteq-t a a)
      identity = (nat-lteq-reflexive a)

      compose = nat-lteq-transitive

      identity-neutral-left x =
        case x
          zero-lteq-t eqv-c
          succ-lteq-t (eqv-apply succ-lteq-c (recur x.prev))

      identity-neutral-righ x =
        case x
          zero-lteq-t eqv-c
          succ-lteq-t (eqv-apply succ-lteq-c (recur x.prev))

      compose-associative f g h =
        case [f g h]
          [zero-lteq-t _ _] eqv-c
          [succ-lteq-t succ-lteq-t succ-lteq-t]
            (eqv-apply succ-lteq-c (recur f.prev g.prev h.prev))
    #+end_src

* groupoid

*** groupoid-tt

    #+begin_src cicada
    groupoid-tt : type-ttt
    groupoid-tt = data <: [category-tt]
      inverse : -- f : (arrow-tt a b) -> (isomorphic-tt a b f)
    #+end_src

* [todo] nat-total-order

* monoid

*** monoid-tt

    #+begin_src cicada
    monoid-tt : type-ttt
    monoid-tt = data
      element-t : type-tt

      element-eqv-t :
        -- element-t element-t
        -> type-tt

      unit : element-t

      product :
        -- element-t element-t
        -> element-t

      unit-neutral-left :
        -- a : element-t
        -> (element-eqv-t (product a unit) a)

      unit-neutral-right :
        -- a : element-t
        -> (element-eqv-t (product unit a) a)

      product-associative :
        -- a : element-t
           b : element-t
           c : element-t
        -> (element-eqv-t
             (product a (product b c))
             (product (product a b) c))
    #+end_src

*** monoid.as-category

    #+begin_src cicada
    monoid.as-category : category-tt
    monoid.as-category = category-cc
      object-t = unit-t
      arrow-t _ _ = element-t
      arrow-eqv-t = element-eqv-t
      identity = unit
      compose = product
      identity-neutral-left = unit-neutral-left
      identity-neutral-right = unit-neutral-right
      compose-associative = product-associative
    #+end_src

* [todo] group

* [todo] abelian-group

* [todo] ring

* [todo] field

* [todo] vector-space

* [todo] limit

* container

