prelude.html

<div id="outline-container-orgeb4970c" class="outline-3">
<h3 id="orgeb4970c">nat-lteq-reflexive</h3>
<div class="outline-text-3" id="text-orgeb4970c">
<div class="org-src-container">

<pre class="src src-cicada">nat-lteq-reflexive <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> n <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> n n)
nat-lteq-reflexive n <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> n
    <span style="color: #7CB8BB;">zero-t</span> <span style="color: #DFAF8F;">zero-lteq-c</span>
    <span style="color: #7CB8BB;">succ-t</span> (<span style="color: #DFAF8F;">succ-lteq-c</span> (<span style="color: #7CB8BB;">recur</span> n.prev))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4b2bee" class="outline-3">
<h3 id="orgb4b2bee">nat-lteq-transitive</h3>
<div class="outline-text-3" id="text-orgb4b2bee">
<div class="org-src-container">

<pre class="src src-cicada">nat-lteq-transitive <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> a b)
     (<span style="color: #7CB8BB;">nat-lteq-t</span> b c)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> a c)
nat-lteq-transitive x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> x
    <span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #DFAF8F;">zero-lteq-c</span>
    <span style="color: #7CB8BB;">succ-lteq-t</span> (<span style="color: #DFAF8F;">succ-lteq-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev y.prev))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5132c04" class="outline-3">
<h3 id="org5132c04">nat-lt-t</h3>
<div class="outline-text-3" id="text-org5132c04">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">nat-lt-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">nat-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">nat-lt-t</span> l r <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> (<span style="color: #DFAF8F;">succ-c</span> l) r)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge370217" class="outline-3">
<h3 id="orge370217">nat-archimedean-property</h3>
<div class="outline-text-3" id="text-orge370217">
<div class="org-src-container">

<pre class="src src-cicada">nat-archimedean-property <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> x <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> y <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">nat-t</span>
        (<span style="color: #7CB8BB;">nat-lt-t</span> x y))
nat-archimedean-property x <span style="color: #DFAF8F;">=</span>
  (<span style="color: #7CB8BB;">*</span> (<span style="color: #DFAF8F;">succ-c</span> x) (nat-lteq-reflexive (<span style="color: #DFAF8F;">succ-c</span> x)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org50db30f" class="outline-3">
<h3 id="org50db30f">nat-order-category</h3>
<div class="outline-text-3" id="text-org50db30f">
<div class="org-src-container">

<pre class="src src-cicada">nat-order-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tt</span>
nat-order-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cc</span>
  <span style="color: #7CB8BB;">object-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">nat-t</span>
  <span style="color: #7CB8BB;">arrow-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">nat-lteq-t</span>
  <span style="color: #7CB8BB;">arrow-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">eqv-t</span>

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">nat-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">nat-lteq-t</span> a a)
  identity <span style="color: #DFAF8F;">=</span> (nat-lteq-reflexive a)

  compose <span style="color: #DFAF8F;">=</span> nat-lteq-transitive

  identity-neutral-left x <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> x
      <span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #DFAF8F;">eqv-c</span>
      <span style="color: #7CB8BB;">succ-lteq-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-lteq-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev))

  identity-neutral-righ x <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> x
      <span style="color: #7CB8BB;">zero-lteq-t</span> <span style="color: #DFAF8F;">eqv-c</span>
      <span style="color: #7CB8BB;">succ-lteq-t</span> (eqv-apply <span style="color: #DFAF8F;">succ-lteq-c</span> (<span style="color: #7CB8BB;">recur</span> x.prev))

  compose-associative f g h <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> [f g h]
      [<span style="color: #7CB8BB;">zero-lteq-t</span> _ _] <span style="color: #DFAF8F;">eqv-c</span>
      [<span style="color: #7CB8BB;">succ-lteq-t</span> <span style="color: #7CB8BB;">succ-lteq-t</span> <span style="color: #7CB8BB;">succ-lteq-t</span>]
        (eqv-apply <span style="color: #DFAF8F;">succ-lteq-c</span> (<span style="color: #7CB8BB;">recur</span> f.prev g.prev h.prev))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3f4375f" class="outline-2">
<h2 id="org3f4375f">groupoid</h2>
<div class="outline-text-2" id="text-org3f4375f">
</div><div id="outline-container-org782e9f8" class="outline-3">
<h3 id="org782e9f8">groupoid-tt</h3>
<div class="outline-text-3" id="text-org782e9f8">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">groupoid-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">groupoid-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">category-tt</span>]
  inverse <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">arrow-tt</span> a b) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">isomorphic-tt</span> a b f)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d01c26" class="outline-2">
<h2 id="org4d01c26"><span class="done _todo_">[todo]</span> nat-total-order</h2>
</div>

<div id="outline-container-org4bcf2b1" class="outline-2">
<h2 id="org4bcf2b1">monoid</h2>
<div class="outline-text-2" id="text-org4bcf2b1">
</div><div id="outline-container-org316bd81" class="outline-3">
<h3 id="org316bd81">monoid-tt</h3>
<div class="outline-text-3" id="text-org316bd81">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">monoid-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">monoid-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">element-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

  <span style="color: #7CB8BB;">element-eqv-t</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">element-t</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>

  unit <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>

  product <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">element-t</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">element-t</span>

  unit-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">element-eqv-t</span> (product a unit) a)

  unit-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">element-eqv-t</span> (product unit a) a)

  product-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
       b <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
       c <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">element-eqv-t</span>
         (product a (product b c))
         (product (product a b) c))
</pre>
</div>
</div>
</div>

<div id="outline-container-org463b37c" class="outline-3">
<h3 id="org463b37c">monoid.as-category</h3>
<div class="outline-text-3" id="text-org463b37c">
<div class="org-src-container">

<pre class="src src-cicada">monoid.as-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tt</span>
monoid.as-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cc</span>
  <span style="color: #7CB8BB;">object-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">unit-t</span>
  <span style="color: #7CB8BB;">arrow-t</span> _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">element-t</span>
  <span style="color: #7CB8BB;">arrow-eqv-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">element-eqv-t</span>
  identity <span style="color: #DFAF8F;">=</span> unit
  compose <span style="color: #DFAF8F;">=</span> product
  identity-neutral-left <span style="color: #DFAF8F;">=</span> unit-neutral-left
  identity-neutral-right <span style="color: #DFAF8F;">=</span> unit-neutral-right
  compose-associative <span style="color: #DFAF8F;">=</span> product-associative
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82394af" class="outline-2">
<h2 id="org82394af"><span class="done _todo_">[todo]</span> group</h2>
</div>

<div id="outline-container-org8354133" class="outline-2">
<h2 id="org8354133"><span class="done _todo_">[todo]</span> abelian-group</h2>
</div>

<div id="outline-container-orgd2b30fe" class="outline-2">
<h2 id="orgd2b30fe"><span class="done _todo_">[todo]</span> ring</h2>
</div>

<div id="outline-container-org193b4f2" class="outline-2">
<h2 id="org193b4f2"><span class="done _todo_">[todo]</span> field</h2>
</div>

<div id="outline-container-org90c45a1" class="outline-2">
<h2 id="org90c45a1"><span class="done _todo_">[todo]</span> vector-space</h2>
</div>
