src/prelude.org
*** container-tt

    #+begin_src cicada
    note
      endofunctor of set-category

    container-tt : type-ttt
    container-tt = data
      fun-t : -- type-tt -> type-tt
      map : -- (-- a -> b) (fun-tt a) -> (fun-t b)
    #+end_src

*** list-container

    #+begin_src cicada
    list-container : container-tt
    list-container = container-cc
      fun-t = list-t
      map fun list =
        case list
          null-t null-c
          cons-t
            (cons-c (fun list.car) (recur fun list.cdr))
    #+end_src

* const

*** const-t

    #+begin_src cicada
    const-t : type-tt
    const-t = data
      [c a] : type-tt
      value : c
    #+end_src

*** const-container

    #+begin_src cicada
    const-container : -- type-tt -> container-tt
    const-container c = container-cc
      fun-t = (const-t c)

      map : -- (-- a -> b) (const-t c a) -> (const-t c b)
      map _ x = x
    #+end_src

* monad

*** monad-tt

    #+begin_src cicada
    monad-tt : type-ttt
    monad-tt = data <: [container-tt]
      pure : -- t -> (fun-t t)
      bind : -- (fun-t a) (-- a -> (fun-t b)) -> (fun-t b)
    #+end_src

*** monad.compose

    #+begin_src cicada
    monad.compose :
      -- (-- a -> (fun-t b))
         (-- b -> (fun-t c))
      -> (-- a -> (fun-t c))
    monad.compose f g = (lambda [a] (bind (f a) g))
    #+end_src

*** monad.flatten

    #+begin_src cicada
    monad.flatten :
      -- (fun-t (fun-t a))
      -> (fun-t a)
    monad.flatten m = (bind m (lambda []))
    #+end_src

*** list-monad

    #+begin_src cicada
    list-monad : monad-tt
    list-monad = monad-cc
      pure x = (cons-c x null-c)
      bind list fun =
        case list
          null-t null-c
          cons-t (list-append (fun list.car) (recur list.cdr fun))
    #+end_src

* maybe

*** maybe-t

    #+begin_src cicada
    maybe-t : type-tt
    maybe-t = data :> [none-t just-t]
      t : type-tt

    none-t : type-tt
    none-t = data
      t : type-tt

    just-t : type-tt
    just-t = data
      t : type-tt
      value : t
    #+end_src

*** maybe-container

    #+begin_src cicada
    maybe-container : container-tt
    maybe-container = container-cc
      fun-t = maybe-t
      map fun maybe =
        case maybe
          none-t none-c
          just-t (just-c (fun maybe.value))
    #+end_src

*** maybe-monad

    #+begin_src cicada
    maybe-monad : monad-tt
    maybe-monad = monad-cc
      pure = just-c
      bind maybe fun =
        case maybe
          none-t none-c
          just-t (fun maybe.value)
    #+end_src

* state

*** state-t

    #+begin_src cicada
    state-t : -- type-tt type-tt -> type-tt
    state-t s a = -- s -> (* s a)
    #+end_src

