prelude.html

<div id="outline-container-org3de5158" class="outline-2">
<h2 id="org3de5158"><span class="done _todo_">[todo]</span> limit</h2>
</div>

<div id="outline-container-org27684e5" class="outline-2">
<h2 id="org27684e5">container</h2>
<div class="outline-text-2" id="text-org27684e5">
</div><div id="outline-container-org551dd88" class="outline-3">
<h3 id="org551dd88">container-tt</h3>
<div class="outline-text-3" id="text-org551dd88">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  endofunctor <span style="color: #F0DFAF; font-weight: bold;">of</span> <span style="color: #7CB8BB;">set-category</span>

<span style="color: #7CB8BB;">container-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">container-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
  map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b) (<span style="color: #7CB8BB;">fun-tt</span> a) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b)
</pre>
</div>
</div>
</div>

<div id="outline-container-org472f598" class="outline-3">
<h3 id="org472f598">list-container</h3>
<div class="outline-text-3" id="text-org472f598">
<div class="org-src-container">

<pre class="src src-cicada">list-container <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">container-tt</span>
list-container <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">container-cc</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">list-t</span>
  map fun list <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> list
      <span style="color: #7CB8BB;">null-t</span> <span style="color: #DFAF8F;">null-c</span>
      <span style="color: #7CB8BB;">cons-t</span>
        (<span style="color: #DFAF8F;">cons-c</span> (fun list.car) (<span style="color: #7CB8BB;">recur</span> fun list.cdr))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8301a7f" class="outline-2">
<h2 id="org8301a7f">const</h2>
<div class="outline-text-2" id="text-org8301a7f">
</div><div id="outline-container-orgf6cad3" class="outline-3">
<h3 id="orgf6cad3">const-t</h3>
<div class="outline-text-3" id="text-orgf6cad3">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">const-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">const-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [c a] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  value <span style="color: #DFAF8F;">:</span> c
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbacc45" class="outline-3">
<h3 id="orgbacc45">const-container</h3>
<div class="outline-text-3" id="text-orgbacc45">
<div class="org-src-container">

<pre class="src src-cicada">const-container <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">container-tt</span>
const-container c <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">container-cc</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">const-t</span> c)

  map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b) (<span style="color: #7CB8BB;">const-t</span> c a) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">const-t</span> c b)
  map _ x <span style="color: #DFAF8F;">=</span> x
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b529e2" class="outline-2">
<h2 id="org3b529e2">monad</h2>
<div class="outline-text-2" id="text-org3b529e2">
</div><div id="outline-container-org62f6d1a" class="outline-3">
<h3 id="org62f6d1a">monad-tt</h3>
<div class="outline-text-3" id="text-org62f6d1a">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">monad-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">monad-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">container-tt</span>]
  pure <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> t <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> t)
  bind <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">fun-t</span> a) (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b)) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8acb74a" class="outline-3">
<h3 id="org8acb74a">monad.compose</h3>
<div class="outline-text-3" id="text-org8acb74a">
<div class="org-src-container">

<pre class="src src-cicada">monad.compose <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b))
     (<span style="color: #7CB8BB;">--</span> b <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> c))
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> c))
monad.compose f g <span style="color: #DFAF8F;">=</span> (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> [a] (<span style="color: #F0DFAF; font-weight: bold;">bind</span> (f a) g))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1b3b32" class="outline-3">
<h3 id="orgb1b3b32">monad.flatten</h3>
<div class="outline-text-3" id="text-orgb1b3b32">
<div class="org-src-container">

<pre class="src src-cicada">monad.flatten <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">fun-t</span> (<span style="color: #7CB8BB;">fun-t</span> a))
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> a)
monad.flatten m <span style="color: #DFAF8F;">=</span> (<span style="color: #F0DFAF; font-weight: bold;">bind</span> m (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> []))
</pre>
</div>
</div>
</div>

<div id="outline-container-org38da380" class="outline-3">
<h3 id="org38da380">list-monad</h3>
<div class="outline-text-3" id="text-org38da380">
<div class="org-src-container">

<pre class="src src-cicada">list-monad <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">monad-tt</span>
list-monad <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">monad-cc</span>
  pure x <span style="color: #DFAF8F;">=</span> (<span style="color: #DFAF8F;">cons-c</span> x <span style="color: #DFAF8F;">null-c</span>)
  bind list fun <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> list
      <span style="color: #7CB8BB;">null-t</span> <span style="color: #DFAF8F;">null-c</span>
      <span style="color: #7CB8BB;">cons-t</span> (list-append (fun list.car) (<span style="color: #7CB8BB;">recur</span> list.cdr fun))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf4cb38e" class="outline-2">
<h2 id="orgf4cb38e">maybe</h2>
<div class="outline-text-2" id="text-orgf4cb38e">
</div><div id="outline-container-org725ca07" class="outline-3">
<h3 id="org725ca07">maybe-t</h3>
<div class="outline-text-3" id="text-org725ca07">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">maybe-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">maybe-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">none-t</span> <span style="color: #7CB8BB;">just-t</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

<span style="color: #7CB8BB;">none-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">none-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

<span style="color: #7CB8BB;">just-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">just-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  value <span style="color: #DFAF8F;">:</span> t
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfde8567" class="outline-3">
<h3 id="orgfde8567">maybe-container</h3>
<div class="outline-text-3" id="text-orgfde8567">
<div class="org-src-container">

<pre class="src src-cicada">maybe-container <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">container-tt</span>
maybe-container <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">container-cc</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">maybe-t</span>
  map fun maybe <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> maybe
      <span style="color: #7CB8BB;">none-t</span> <span style="color: #DFAF8F;">none-c</span>
      <span style="color: #7CB8BB;">just-t</span> (<span style="color: #DFAF8F;">just-c</span> (fun maybe.value))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d7b3c6" class="outline-3">
<h3 id="org5d7b3c6">maybe-monad</h3>
<div class="outline-text-3" id="text-org5d7b3c6">
<div class="org-src-container">

<pre class="src src-cicada">maybe-monad <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">monad-tt</span>
maybe-monad <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">monad-cc</span>
  pure <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">just-c</span>
  bind maybe fun <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> maybe
      <span style="color: #7CB8BB;">none-t</span> <span style="color: #DFAF8F;">none-c</span>
      <span style="color: #7CB8BB;">just-t</span> (fun maybe.value)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge8bbaa" class="outline-2">
<h2 id="orge8bbaa">state</h2>
<div class="outline-text-2" id="text-orge8bbaa">
</div><div id="outline-container-org2301221" class="outline-3">
<h3 id="org2301221">state-t</h3>
<div class="outline-text-3" id="text-org2301221">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">state-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">state-t</span> s a <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s a)
</pre>
</div>
</div>
</div>
