src/prelude.org
*** state-monad

    #+begin_src cicada
    state-monad : -- type-tt -> monad-tt
    state-monad s = monad-cc
      fun-t = (state-t s)

      map : -- (-- a -> b)
               (state-t s a)
            -> (state-t s b)
      map : -- (-- a -> b)
               (-- s -> (* s a))
            -> (-- s -> (* s b))
      map f m = lambda [s]
        * (1st (m s))
          (f (2nd (m s)))

      pure : -- t -> (state-t s t)
      pure : -- t -> (-- s -> (* s t))
      pure v = lambda [s] (* s v)

      bind : -- (fun-t a) (-- a -> (fun-t b)) -> (fun-t b)
      bind : -- (state-t s a) (-- a -> (state-t s b)) -> (state-t s b)
      bind : -- (-- s -> (* s a))
                (-- a -> (-- s -> (* s b)))
             -> (-- s -> (* s b))
      bind m f = lambda [s] ((f (2st (m s))) (1st (m s)))
    #+end_src

* tree

*** tree-t

    #+begin_src cicada
    tree-t : type-tt
    tree-t = data :> [leaf-t branch-t]
      t : type-tt

    leaf-t : type-tt
    leaf-t = data
      t : type-tt
      value : t

    branch-t : type-tt
    branch-t = data
      t : type-tt
      [left right] : (tree-t t)
    #+end_src

*** tree-container

    #+begin_src cicada
    tree-container : container-tt
    tree-container = container-cc
      fun-t = tree-t
      map fun tree =
        case tree
          leaf-t (leaf-c (fun tree.value))
          branch-t
            (branch-c
              (recur fun tree.left)
              (recur fun tree.right))
    #+end_src

*** tree-zip

    #+begin_src cicada
    tree-zip :
      -- (tree-t a)
         (tree-t b)
      -> (maybe-t (tree-t (* a b)))
    tree-zip x y =
      case [x y]
        [leaf-t leaf-t]
          (pure (leaf-c (* x.value y.value)))
        [branch-t branch-t]
          do left <- (recur x.left y.left)
             right <- (recur x.right y.right)
             (pure (branch-c left right))
        [_ _] none-c
    #+end_src

*** tree-numbering

    #+begin_src cicada
    tree-numbering :
      -- (tree-t t)
      -> (state-t nat-t (tree-t nat-t))
    tree-numbering tree =
      case tree
        leaf-t lambda [n]
          (* (nat-inc n) (leaf-c n))
        branch-t
          do left <- (recur tree.left)
             right <- (recur tree.right)
             (pure (branch-c left right))
    #+end_src

* int

*** [todo] int-t

*** [todo] mod-t

*** gcd-t

    #+begin_src cicada
    gcd-t : type-tt
    gcd-t = data :> [zero-gcd-t mod-gcd-t]
      [x y d] : int-t

    zero-gcd-t : type-tt
    zero-gcd-t = data
      [x y d] : int-t
      y = zero-c
      x = d

    mod-gcd-t : type-tt
    mod-gcd-t = data
      [x y d] : int-t
      gcd : (gcd-t z x d)
      mod : (mod-t z x y)
    #+end_src

* set-category

