prelude.html

<div id="outline-container-org20ecec9" class="outline-3">
<h3 id="org20ecec9">state-monad</h3>
<div class="outline-text-3" id="text-org20ecec9">
<div class="org-src-container">

<pre class="src src-cicada">state-monad <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">monad-tt</span>
state-monad s <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">monad-cc</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">state-t</span> s)

  map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b)
           (<span style="color: #7CB8BB;">state-t</span> s a)
        <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">state-t</span> s b)
  map <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> b)
           (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s a))
        <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s b))
  map f m <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">lambda</span> [s]
    <span style="color: #7CB8BB;">*</span> (1st (m s))
      (f (2nd (m s)))

  pure <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> t <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">state-t</span> s t)
  pure <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> t <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s t))
  pure v <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">lambda</span> [s] (<span style="color: #7CB8BB;">*</span> s v)

  bind <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">fun-t</span> a) (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b)) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">fun-t</span> b)
  bind <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">state-t</span> s a) (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">state-t</span> s b)) <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">state-t</span> s b)
  bind <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s a))
            (<span style="color: #7CB8BB;">--</span> a <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s b)))
         <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">--</span> s <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">*</span> s b))
  bind m f <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">lambda</span> [s] ((f (2st (m s))) (1st (m s)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1747e97" class="outline-2">
<h2 id="org1747e97">tree</h2>
<div class="outline-text-2" id="text-org1747e97">
</div><div id="outline-container-org1562580" class="outline-3">
<h3 id="org1562580">tree-t</h3>
<div class="outline-text-3" id="text-org1562580">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">tree-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">tree-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">leaf-t</span> <span style="color: #7CB8BB;">branch-t</span>]
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

<span style="color: #7CB8BB;">leaf-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">leaf-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  value <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">t</span>

<span style="color: #7CB8BB;">branch-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">branch-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  t <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  [left right] <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">tree-t</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bff4e5" class="outline-3">
<h3 id="org2bff4e5">tree-container</h3>
<div class="outline-text-3" id="text-org2bff4e5">
<div class="org-src-container">

<pre class="src src-cicada">tree-container <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">container-tt</span>
tree-container <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">container-cc</span>
  <span style="color: #7CB8BB;">fun-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">tree-t</span>
  map fun tree <span style="color: #DFAF8F;">=</span>
    <span style="color: #F0DFAF; font-weight: bold;">case</span> tree
      <span style="color: #7CB8BB;">leaf-t</span> (<span style="color: #DFAF8F;">leaf-c</span> (fun tree.value))
      <span style="color: #7CB8BB;">branch-t</span>
        (<span style="color: #DFAF8F;">branch-c</span>
          (<span style="color: #7CB8BB;">recur</span> fun tree.left)
          (<span style="color: #7CB8BB;">recur</span> fun tree.right))
</pre>
</div>
</div>
</div>

<div id="outline-container-org708df32" class="outline-3">
<h3 id="org708df32">tree-zip</h3>
<div class="outline-text-3" id="text-org708df32">
<div class="org-src-container">

<pre class="src src-cicada">tree-zip <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">tree-t</span> a)
     (<span style="color: #7CB8BB;">tree-t</span> b)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">maybe-t</span> (<span style="color: #7CB8BB;">tree-t</span> (<span style="color: #7CB8BB;">*</span> a b)))
tree-zip x y <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> [x y]
    [<span style="color: #7CB8BB;">leaf-t</span> <span style="color: #7CB8BB;">leaf-t</span>]
      (pure (<span style="color: #DFAF8F;">leaf-c</span> (<span style="color: #7CB8BB;">*</span> x.value y.value)))
    [<span style="color: #7CB8BB;">branch-t</span> <span style="color: #7CB8BB;">branch-t</span>]
      do left <span style="color: #7CB8BB;">&lt;-</span> (<span style="color: #7CB8BB;">recur</span> x.left y.left)
         right <span style="color: #7CB8BB;">&lt;-</span> (<span style="color: #7CB8BB;">recur</span> x.right y.right)
         (pure (<span style="color: #DFAF8F;">branch-c</span> left right))
    [_ _] <span style="color: #DFAF8F;">none-c</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ae9375" class="outline-3">
<h3 id="org3ae9375">tree-numbering</h3>
<div class="outline-text-3" id="text-org3ae9375">
<div class="org-src-container">

<pre class="src src-cicada">tree-numbering <span style="color: #DFAF8F;">:</span>
  <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">tree-t</span> t)
  <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">state-t</span> <span style="color: #7CB8BB;">nat-t</span> (<span style="color: #7CB8BB;">tree-t</span> <span style="color: #7CB8BB;">nat-t</span>))
tree-numbering tree <span style="color: #DFAF8F;">=</span>
  <span style="color: #F0DFAF; font-weight: bold;">case</span> tree
    <span style="color: #7CB8BB;">leaf-t</span> <span style="color: #F0DFAF; font-weight: bold;">lambda</span> [n]
      (<span style="color: #7CB8BB;">*</span> (nat-inc n) (<span style="color: #DFAF8F;">leaf-c</span> n))
    <span style="color: #7CB8BB;">branch-t</span>
      do left <span style="color: #7CB8BB;">&lt;-</span> (<span style="color: #7CB8BB;">recur</span> tree.left)
         right <span style="color: #7CB8BB;">&lt;-</span> (<span style="color: #7CB8BB;">recur</span> tree.right)
         (pure (<span style="color: #DFAF8F;">branch-c</span> left right))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc27af9a" class="outline-2">
<h2 id="orgc27af9a">int</h2>
<div class="outline-text-2" id="text-orgc27af9a">
</div><div id="outline-container-org90731ff" class="outline-3">
<h3 id="org90731ff"><span class="done _todo_">[todo]</span> int-t</h3>
</div>

<div id="outline-container-org6ebf319" class="outline-3">
<h3 id="org6ebf319"><span class="done _todo_">[todo]</span> mod-t</h3>
</div>

<div id="outline-container-org7619f50" class="outline-3">
<h3 id="org7619f50">gcd-t</h3>
<div class="outline-text-3" id="text-org7619f50">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">gcd-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">gcd-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">:&gt;</span> [<span style="color: #7CB8BB;">zero-gcd-t</span> <span style="color: #7CB8BB;">mod-gcd-t</span>]
  [x y d] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">int-t</span>

<span style="color: #7CB8BB;">zero-gcd-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">zero-gcd-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [x y d] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">int-t</span>
  y <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">zero-c</span>
  x <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">d</span>

<span style="color: #7CB8BB;">mod-gcd-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
<span style="color: #7CB8BB;">mod-gcd-t</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  [x y d] <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">int-t</span>
  gcd <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">gcd-t</span> z x d)
  mod <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">mod-t</span> z x y)
</pre>
</div>
</div>
</div>
</div>
