src/prelude.org
*** [todo] set-tt

    #+begin_src cicada
    note
      The set theory of Errett Bishop.

    set-tt : type-ttt
    set-tt = data
      element-t : type-tt
      eqv-t : -> element-t element-t -> type-tt
    #+end_src

*** set-morphism-tt

    #+begin_src cicada
    set-morphism-tt : type-ttt
    set-morphism-tt = data
      ante : type-tt
      succ : type-tt

      morphism : -- ante -> succ
    #+end_src

*** set-morphism-eqv-tt

    #+begin_src cicada
    set-morphism-eqv-tt : type-ttt
    set-morphism-eqv-tt = data
      lhs : (set-morphism-tt a b)
      rhs : (set-morphism-tt a b)

      morphism-eqv :
        -- x : a
        -> (eqv-t (lhs.morphism x) (rhs.morphism x))
    #+end_src

*** set-category

    #+begin_src cicada
    set-category : category-ttt
    set-category = category-ccc
      object-tt : type-ttt
      object-tt = type-tt

      arrow-tt : -- type-tt type-tt -> type-ttt
      arrow-tt a b = (set-morphism-tt a b)

      arrow-eqv-tt :
        -- (set-morphism-tt a b)
           (set-morphism-tt a b)
        -> type-ttt
      arrow-eqv-tt lhs rhs = (set-morphism-eqv-tt lhs rhs)

      identity :
        -- a :: type-tt
        -> (set-morphism-tt a a)
      identity = set-morphism-cc
        morphism = nop

      compose :
        -- (set-morphism-tt a b)
           (set-morphism-tt b c)
        -> (set-morphism-tt a c)
      compose f g = set-morphism-cc
        morphism = (| f.morphism g.morphism)

      identity-neutral-left :
        -- f : (set-morphism-tt a b)
        -> (set-morphism-eqv-tt f (compose f identity))
      identity-neutral-left f = set-morphism-eqv-cc
        lhs : (set-morphism-tt a b)
        lhs = f
        rhs : (set-morphism-tt a b)
        rhs = (compose f identity)
        morphism-eqv :
          -- x : a
          -> (eqv-t (f.morphism x) (f.morphism x))
        morphism-eqv x = eqv-c

      identity-neutral-right :
        -- f : (set-morphism-tt a b)
        -> (set-morphism-eqv-tt f (compose identity f))
      identity-neutral-right f = set-morphism-eqv-cc
        morphism-eqv _ = eqv-c

      compose-associative :
        -- f : (set-morphism-tt a b)
           g : (set-morphism-tt b c)
           h : (set-morphism-tt c d)
        -> (set-morphism-eqv-tt
             lhs = (compose f (compose g h))
             rhs = (compose (compose f g) h))
      compose-associative f g h = set-morphism-eqv-cc
        morphism-eqv _ = eqv-c
    #+end_src

*** set-category -- without type

    #+begin_src cicada
    set-category : category-ttt
    set-category = category-ccc
      object-tt = type-tt

      arrow-tt a b = (set-morphism-tt a b)

      arrow-eqv-tt lhs rhs = (set-morphism-eqv-tt lhs rhs)

      identity = set-morphism-cc
        morphism = nop

      compose f g = set-morphism-cc
        morphism = (| f.morphism g.morphism)

      identity-neutral-left _ = set-morphism-eqv-cc
        morphism-eqv _ = eqv-c

      identity-neutral-right _ = set-morphism-eqv-cc
        morphism-eqv _ = eqv-c

      compose-associative _ _ _ = set-morphism-eqv-cc
        morphism-eqv _ = eqv-c
    #+end_src

* preorder-category

*** preorder-morphism-tt

    #+begin_src cicada
    preorder-morphism-tt : type-ttt
    preorder-morphism-tt = data
      ante : preorder-tt
      succ : preorder-tt

      morphism : -- ante.element-t -> succ.element-t

      morphism-respect-pre-relation :
        -- (ante.pre-t x y)
        -> (succ.pre-t (morphism x) (morphism y))
    #+end_src

