prelude.html

<div id="outline-container-org20e4379" class="outline-2">
<h2 id="org20e4379">set-category</h2>
<div class="outline-text-2" id="text-org20e4379">
</div><div id="outline-container-orgc55ed1c" class="outline-3">
<h3 id="orgc55ed1c"><span class="done _todo_">[todo]</span> set-tt</h3>
<div class="outline-text-3" id="text-orgc55ed1c">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #F0DFAF; font-weight: bold;">note</span>
  <span style="color: #7CB8BB;">The</span> <span style="color: #F0DFAF; font-weight: bold;">set</span> theory <span style="color: #F0DFAF; font-weight: bold;">of</span> <span style="color: #7CB8BB;">Errett</span> <span style="color: #7CB8BB;">Bishop.</span>

<span style="color: #7CB8BB;">set-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">set-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  <span style="color: #7CB8BB;">element-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  <span style="color: #7CB8BB;">eqv-t</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">element-t</span> <span style="color: #7CB8BB;">element-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tt</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bdf96b" class="outline-3">
<h3 id="org2bdf96b">set-morphism-tt</h3>
<div class="outline-text-3" id="text-org2bdf96b">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">set-morphism-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">set-morphism-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  ante <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>
  succ <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tt</span>

  morphism <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> ante <span style="color: #7CB8BB;">-&gt;</span> succ
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b8fca1" class="outline-3">
<h3 id="org2b8fca1">set-morphism-eqv-tt</h3>
<div class="outline-text-3" id="text-org2b8fca1">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">set-morphism-eqv-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">set-morphism-eqv-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  lhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
  rhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)

  morphism-eqv <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> x <span style="color: #DFAF8F;">:</span> a
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> (lhs.morphism x) (rhs.morphism x))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb60068" class="outline-3">
<h3 id="orgeb60068">set-category</h3>
<div class="outline-text-3" id="text-orgeb60068">
<div class="org-src-container">

<pre class="src src-cicada">set-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>
set-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-ccc</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">type-tt</span>

  <span style="color: #7CB8BB;">arrow-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">type-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-tt</span> a b <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)

  <span style="color: #7CB8BB;">arrow-eqv-tt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
       (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-eqv-tt</span> lhs rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">set-morphism-eqv-tt</span> lhs rhs)

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">type-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a a)
  identity <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> nop

  compose <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
       (<span style="color: #7CB8BB;">set-morphism-tt</span> b c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a c)
  compose f g <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">|</span> f.morphism g.morphism)

  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">set-morphism-eqv-tt</span> f (compose f identity))
  identity-neutral-left f <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    lhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
    lhs <span style="color: #DFAF8F;">=</span> f
    rhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
    rhs <span style="color: #DFAF8F;">=</span> (compose f identity)
    morphism-eqv <span style="color: #DFAF8F;">:</span>
      <span style="color: #7CB8BB;">--</span> x <span style="color: #DFAF8F;">:</span> a
      <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> (f.morphism x) (f.morphism x))
    morphism-eqv x <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">set-morphism-eqv-tt</span> f (compose identity f))
  identity-neutral-right f <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> c d)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">set-morphism-eqv-tt</span>
         lhs <span style="color: #DFAF8F;">=</span> (compose f (compose g h))
         rhs <span style="color: #DFAF8F;">=</span> (compose (compose f g) h))
  compose-associative f g h <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fdb6fe" class="outline-3">
<h3 id="org6fdb6fe">set-category &#x2013; without type</h3>
<div class="outline-text-3" id="text-org6fdb6fe">
<div class="org-src-container">

<pre class="src src-cicada">set-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>
set-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-ccc</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">type-tt</span>

  <span style="color: #7CB8BB;">arrow-tt</span> a b <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">set-morphism-tt</span> a b)

  <span style="color: #7CB8BB;">arrow-eqv-tt</span> lhs rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">set-morphism-eqv-tt</span> lhs rhs)

  identity <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> nop

  compose f g <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">|</span> f.morphism g.morphism)

  identity-neutral-left _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  identity-neutral-right _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  compose-associative _ _ _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">set-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org42333bb" class="outline-2">
<h2 id="org42333bb">preorder-category</h2>
<div class="outline-text-2" id="text-org42333bb">
</div><div id="outline-container-orgaa3178" class="outline-3">
<h3 id="orgaa3178">preorder-morphism-tt</h3>
<div class="outline-text-3" id="text-orgaa3178">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">preorder-morphism-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">preorder-morphism-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  ante <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">preorder-tt</span>
  succ <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">preorder-tt</span>

  morphism <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">ante.element-t</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">succ.element-t</span>

  morphism-respect-pre-relation <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">ante.pre-t</span> x y)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.pre-t</span> (morphism x) (morphism y))
</pre>
</div>
</div>
</div>
