src/prelude.org
*** preorder-morphism-eqv-tt

    #+begin_src cicada
    preorder-morphism-eqv-tt : type-ttt
    preorder-morphism-eqv-tt = data
      lhs : (preorder-morphism-tt a b)
      rhs : (preorder-morphism-tt a b)

      morphism-eqv :
        -- x : a.element-t
        -> (eqv-t (lhs.morphism x) (rhs.morphism x))
    #+end_src

*** preorder-category

    #+begin_src cicada
    preorder-category : category-ttt
    preorder-category = category-ccc
      object-tt : type-ttt
      object-tt = preorder-tt

      arrow-tt : -- preorder-tt preorder-tt -> type-ttt
      arrow-tt a b = (preorder-morphism-tt a b)

      arrow-eqv-tt :
        -- (preorder-morphism-tt a b)
           (preorder-morphism-tt a b)
        -> type-ttt
      arrow-eqv-tt lhs rhs = (preorder-morphism-eqv-tt lhs rhs)

      identity :
        -- a :: preorder-tt
        -> (preorder-morphism-tt a a)
      identity = preorder-morphism-cc
        morphism = nop
        morphism-respect-pre-relation = nop

      compose :
        -- (preorder-morphism-tt a b)
           (preorder-morphism-tt b c)
        -> (preorder-morphism-tt a c)
      compose f g = preorder-morphism-cc
        morphism = (| f.morphism g.morphism)
        morphism-respect-pre-relation =
          (| f.morphism-respect-pre-relation
             g.morphism-respect-pre-relation)

      identity-neutral-left f = preorder-morphism-eqv-cc
        morphism-eqv x = eqv-c

      identity-neutral-right f = preorder-morphism-eqv-cc
        morphism-eqv _ = eqv-c

      compose-associative f g h = preorder-morphism-eqv-cc
        morphism-eqv _ = eqv-c
    #+end_src

* category-category

*** functor-ttt

    - a functor between two categories is a natural-construction
      of the structure of [ante : category-ttt]
      in the structure of [succ : category-ttt]

    #+begin_src cicada
    functor-ttt : type-tttt
    functor-ttt = data
      ante : category-ttt
      succ : category-ttt

      object-map :
        -- ante.object-tt
        -> succ.object-tt

      arrow-map :
        -- (ante.arrow-tt a b)
        -> (succ.arrow-tt (object-map a) (object-map b))

      arrow-map-respect-compose :
        -- f : (ante.arrow-tt a b)
           g : (ante.arrow-tt b c)
        -> (succ.arrow-eqv-tt
             (arrow-map (ante.compose f g))
             (succ.compose (arrow-map f) (arrow-map g)))

      arrow-map-respect-identity :
        -- a :: ante.object-tt
        -> (succ.arrow-eqv-tt
             (arrow-map (ante.identity a))
             (succ.identity (object-map a)))
    #+end_src

*** natural-transformation-ttt

    - a natural-transformation is a level up map,
      which maps objects to arrows, and arrows to squares.

    #+begin_src cicada
    natural-transformation-ttt : type-tttt
    natural-transformation-ttt = data
      lhs : (functor-ttt ante succ)
      rhs : (functor-ttt ante succ)

      ante succ :: object-ttt

      component :
        -- a : ante.object-tt
        -> (succ.arrow-tt (lhs.object-map a) (rhs.object-map a))

      transformation :
        -- f : (ante.arrow-tt a b)
        -> (succ.arrow-eqv-tt
             (succ.compose (component a) (rhs.arrow-map f))
             (succ.compose (lhs.arrow-map f) (component b)))
    #+end_src

*** natural-isomorphism-ttt

    #+begin_src cicada
    natural-isomorphism-ttt : type-tttt
    natural-isomorphism-ttt = data <: [natural-transformation-ttt]
      isomorphic-component :
        -- a : ante.object-tt
        -> (succ.isomorphic-tt iso = (component a))
    #+end_src

