prelude.html

<div id="outline-container-org3da2328" class="outline-3">
<h3 id="org3da2328">preorder-morphism-eqv-tt</h3>
<div class="outline-text-3" id="text-org3da2328">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">preorder-morphism-eqv-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
<span style="color: #7CB8BB;">preorder-morphism-eqv-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  lhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)
  rhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)

  morphism-eqv <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> x <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">a.element-t</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">eqv-t</span> (lhs.morphism x) (rhs.morphism x))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c5d8a" class="outline-3">
<h3 id="org7c5d8a">preorder-category</h3>
<div class="outline-text-3" id="text-org7c5d8a">
<div class="org-src-container">

<pre class="src src-cicada">preorder-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>
preorder-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-ccc</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">object-tt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">preorder-tt</span>

  <span style="color: #7CB8BB;">arrow-tt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">preorder-tt</span> <span style="color: #7CB8BB;">preorder-tt</span> <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-tt</span> a b <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)

  <span style="color: #7CB8BB;">arrow-eqv-tt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)
       (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-ttt</span>
  <span style="color: #7CB8BB;">arrow-eqv-tt</span> lhs rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">preorder-morphism-eqv-tt</span> lhs rhs)

  identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">preorder-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a a)
  identity <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">preorder-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> nop
    morphism-respect-pre-relation <span style="color: #DFAF8F;">=</span> nop

  compose <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a b)
       (<span style="color: #7CB8BB;">preorder-morphism-tt</span> b c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">preorder-morphism-tt</span> a c)
  compose f g <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">preorder-morphism-cc</span>
    morphism <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">|</span> f.morphism g.morphism)
    morphism-respect-pre-relation <span style="color: #DFAF8F;">=</span>
      (<span style="color: #7CB8BB;">|</span> f.morphism-respect-pre-relation
         g.morphism-respect-pre-relation)

  identity-neutral-left f <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">preorder-morphism-eqv-cc</span>
    morphism-eqv x <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  identity-neutral-right f <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">preorder-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>

  compose-associative f g h <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">preorder-morphism-eqv-cc</span>
    morphism-eqv _ <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">eqv-c</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org813bf12" class="outline-2">
<h2 id="org813bf12">category-category</h2>
<div class="outline-text-2" id="text-org813bf12">
</div><div id="outline-container-orge636eca" class="outline-3">
<h3 id="orge636eca">functor-ttt</h3>
<div class="outline-text-3" id="text-orge636eca">
<ul class="org-ul">
<li><p>a functor between two categories is a natural-construction</p><p>of the structure of [ante : category-ttt]</p><p>in the structure of [succ : category-ttt]</p></li></ul>

<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">functor-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tttt</span>
<span style="color: #7CB8BB;">functor-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  ante <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>
  succ <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-ttt</span>

  object-map <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">ante.object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">succ.object-tt</span>

  arrow-map <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">ante.arrow-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.arrow-tt</span> (object-map a) (object-map b))

  arrow-map-respect-compose <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">ante.arrow-tt</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">ante.arrow-tt</span> b c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.arrow-eqv-tt</span>
         (arrow-map (ante.compose f g))
         (succ.compose (arrow-map f) (arrow-map g)))

  arrow-map-respect-identity <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">ante.object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.arrow-eqv-tt</span>
         (arrow-map (ante.identity a))
         (succ.identity (object-map a)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb4d22a" class="outline-3">
<h3 id="orgfb4d22a">natural-transformation-ttt</h3>
<div class="outline-text-3" id="text-orgfb4d22a">
<ul class="org-ul">
<li><p>a natural-transformation is a level up map,</p><p>which maps objects to arrows, and arrows to squares.</p></li></ul>

<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">natural-transformation-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tttt</span>
<span style="color: #7CB8BB;">natural-transformation-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span>
  lhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> ante succ)
  rhs <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> ante succ)

  ante succ <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">object-ttt</span>

  component <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">ante.object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.arrow-tt</span> (lhs.object-map a) (rhs.object-map a))

  transformation <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">ante.arrow-tt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.arrow-eqv-tt</span>
         (succ.compose (component a) (rhs.arrow-map f))
         (succ.compose (lhs.arrow-map f) (component b)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org102699d" class="outline-3">
<h3 id="org102699d">natural-isomorphism-ttt</h3>
<div class="outline-text-3" id="text-org102699d">
<div class="org-src-container">

<pre class="src src-cicada"><span style="color: #7CB8BB;">natural-isomorphism-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">type-tttt</span>
<span style="color: #7CB8BB;">natural-isomorphism-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #F0DFAF; font-weight: bold;">data</span> <span style="color: #DFAF8F;">&lt;:</span> [<span style="color: #7CB8BB;">natural-transformation-ttt</span>]
  isomorphic-component <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> a <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">ante.object-tt</span>
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">succ.isomorphic-tt</span> iso <span style="color: #DFAF8F;">=</span> (component a))
</pre>
</div>
</div>
</div>
