src/prelude.org
*** [todo] category-category

    #+begin_src cicada
    category-category : category-tttt
    category-category = category-cccc
      object-ttt : category-tttt
      object-ttt = category-ttt

      arrow-ttt :
        -- category-ttt category-ttt
        -> type-tttt
      arrow-ttt a b = (functor-ttt a b)

      arrow-eqv-ttt :
        -- (functor-ttt a b)
           (functor-ttt a b)
        -> type-tttt
      arrow-eqv-ttt lhs rhs = (natural-isomorphism-ttt lhs rhs)

      identity : -- a :: category-ttt -> (functor-ttt a a)
      identity = functor-ccc
        ante = a
        succ = a
        [todo]

      compose :
        -- (functor-ttt a b)
           (functor-ttt b c)
        -> (functor-ttt a c)


      identity-neutral-left :
        -- f : (functor-ttt a b)
        -> (natural-isomorphism-ttt f (compose identity f))


      identity-neutral-right :
        -- f : (functor-ttt a b)
        -> (natural-isomorphism-ttt f (compose f identity))


      compose-associative :
        -- f : (functor-ttt a b)
           g : (functor-ttt b c)
           h : (functor-ttt c d)
        -> (natural-isomorphism-ttt
             (compose f (compose g h))
             (compose (compose f g) h))

    #+end_src
