prelude.html

<div id="outline-container-org31c5eb8" class="outline-3">
<h3 id="org31c5eb8"><span class="done _todo_">[todo]</span> category-category</h3>
<div class="outline-text-3" id="text-org31c5eb8">
<div class="org-src-container">

<pre class="src src-cicada">category-category <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tttt</span>
category-category <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">category-cccc</span>
  <span style="color: #7CB8BB;">object-ttt</span> <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">category-tttt</span>
  <span style="color: #7CB8BB;">object-ttt</span> <span style="color: #DFAF8F;">=</span> <span style="color: #7CB8BB;">category-ttt</span>

  <span style="color: #7CB8BB;">arrow-ttt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> <span style="color: #7CB8BB;">category-ttt</span> <span style="color: #7CB8BB;">category-ttt</span>
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tttt</span>
  <span style="color: #7CB8BB;">arrow-ttt</span> a b <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)

  <span style="color: #7CB8BB;">arrow-eqv-ttt</span> <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)
       (<span style="color: #7CB8BB;">functor-ttt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> <span style="color: #7CB8BB;">type-tttt</span>
  <span style="color: #7CB8BB;">arrow-eqv-ttt</span> lhs rhs <span style="color: #DFAF8F;">=</span> (<span style="color: #7CB8BB;">natural-isomorphism-ttt</span> lhs rhs)

  identity <span style="color: #DFAF8F;">:</span> <span style="color: #7CB8BB;">--</span> a <span style="color: #BFEBBF;">::</span> <span style="color: #7CB8BB;">category-ttt</span> <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">functor-ttt</span> a a)
  identity <span style="color: #DFAF8F;">=</span> <span style="color: #DFAF8F;">functor-ccc</span>
    ante <span style="color: #DFAF8F;">=</span> a
    succ <span style="color: #DFAF8F;">=</span> a
    [todo]

  compose <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)
       (<span style="color: #7CB8BB;">functor-ttt</span> b c)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">functor-ttt</span> a c)


  identity-neutral-left <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">natural-isomorphism-ttt</span> f (compose identity f))


  identity-neutral-right <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">natural-isomorphism-ttt</span> f (compose f identity))


  compose-associative <span style="color: #DFAF8F;">:</span>
    <span style="color: #7CB8BB;">--</span> f <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> a b)
       g <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> b c)
       h <span style="color: #DFAF8F;">:</span> (<span style="color: #7CB8BB;">functor-ttt</span> c d)
    <span style="color: #7CB8BB;">-&gt;</span> (<span style="color: #7CB8BB;">natural-isomorphism-ttt</span>
         (compose f (compose g h))
         (compose (compose f g) h))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-07-20 Fri 03:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
